{
  "authors": [
    "lumodon",
    "thamaranth"
  ],
  "team_size": 2,
  "goal_id": 102,
  "title": "Web Scraper with Node.js",
  "created_at": "2017-04-05T16:23:00Z",
  "labels": [
    "practice"
  ],
  "published": true,
  "level": "1",
  "url": "http://jsdev.learnersguild.org/goals/102-Build_a_Node_Web_Crawler_-_Web_Scraper.html",
  "xp_value": 100,
  "dynamic": false,
  "content": "# Web Scraper with Node.js\n\n## Challenge Rubric\n\nThis Goal will likely be in your ZPD if you...\n\n- Have built a full-stack application\n- Have worked with databases\n- Can build on a tutorial to make it your own\n- Can render information from an HTTP call\n- Are comfortable with node modules\n- Are interested in learning more about Web Scraper technology\n\n## Description\n\n\"Web scraping is a technique in data extraction where you pull information from websites.\" *1\n\nCreate a web scraper which gathers information from the web. The tutorial listed below will take you through, step by step, setting up your own crawler. Modify this tutorial to fit some subject of interest to you, build an app with unique content of your choosing (i.e a list movie titles with images, a list of related blogs, news articles, etc.).\n\nWeb scrapers are used to pull information from websites where no API is available, or where you're pulling data from multiple sites at once. A web scraper pulls information from HTML. After you have the information it can be formatted and stored in a more structured way like in a JSON object.\n\nWhen designing your scraper think about the kind of data you want to receive. It is possible to search a single page for information or search multiple pages at once for a specific type of content (i.e searching multiple sites to find videos about puppies.) It is your job to build a simple web scraper and then modify it to search for information from several different sites to populate your app.\n\n## Context\n\nThere are many common / practical uses to this, and this is a technique employed by many companies these days. A scraper can be used to populate a list of movies, or particular blogs that you like.\n\nThis project also gives you a great practical example of the limits that efficient code can bring, since you will be pushing the limit of a process when your crawler is running.\n\n## Specifications\n\nFollow the tutorial here:  https://scotch.io/tutorials/scraping-the-web-with-node-js\n\n- [ ] Artifact produced is a repo\n- [ ] Can run a command to start the scraper server\n- [ ] Can scrape a single site for multiple pieces of information (i.e extracting name, director, and release date from IMDB)\n- [ ] Can store information in the form of JSON\n- [ ] Content is generated from multiple sites\n- [ ] Build an interface to display information extracted\n- [ ] UI is easy to navigate and intuitive\n- [ ] Commit messages are concise and descriptive\n- [ ] Code is well formatted without any linting errors\n- [ ] Variables, functions, CSS classes, etc. are meaningfully\n- [ ] Functions are small and serve a single purpose\n- [ ] Code is well organized into a meaningful file structure\n\n## Stretch\n\n- [ ] Recreate the project without jQuery or Request\n- [ ] Recreate the project with another type of content\n\n\n## Resources\n\nTutorial:\n\n- https://scotch.io/tutorials/scraping-the-web-with-node-js\n\n*1: Kukic, Ado. \"Scraping the Web With Node.js.\" Scotch. The Scotch Family, 13 Mar. 2014. Web. https://scotch.io/tutorials/scraping-the-web-with-node-js. Accessed 26 Oct. 2016."
}