{
  "authors": [
    "punitrathore"
  ],
  "team_size": 2,
  "goal_id": 120,
  "title": "Set (the Game) with React",
  "created_at": "2016-12-20T04:23:21Z",
  "labels": [
    "practice"
  ],
  "published": true,
  "level": "2",
  "redirect_from": "/goals/120",
  "url": "http://jsdev.learnersguild.org/goals/120-Set_the_Game_with_React.html",
  "content": "# Set (the Game) with React\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can write programs and tests using Node.js and npm\n- Can use nested conditionals to validate data\n- Have used React.js to implement simple apps\n- Are familiar with pattern-matching card games\n- Are familiar with the concept of \"separation of concerns\" in application design\n- Are interested in advancing your React.js skills\n\n## Description\n\nSet is a wonderfully simple and yet challenging pattern-matching card game. If you haven't played the real-life version, go find it and play it! It's a lot of fun.\n\nIn this goal, you will build a playable version of Set as a static web site (i.e. no server-side logic). You'll have to implement the game logic using JavaScript and the [React.js](https://facebook.github.io/react/) library.\n\nThe official rules of the game are described in full in [this document](http://www.setgame.com/sites/default/files/instructions/SET%20INSTRUCTIONS%20-%20ENGLISH.pdf). Use it as your reference for both the game logic and the card design.\n\n## Context\n\nSet is a game with a small set of rules. This game can be implemented in any technology, although it is a perfect candidate for React because of the real-time nature of the game play.\n\nThis goal will challenge your ability to take a _formal, defined system_ from the real world and replicate it in code. You will start with all of the logic of the system (the rules of the game) and most of the UI already designed (use the card graphics). Your work will be mainly in deciding how to replicate that formal logic and user interface using JavaScript, HTML, and CSS.\n\nIf you choose this goal, you will have to consider questions such as:\n\n- How should the game track its own state?\n- Where should the pattern-matching logic lie?\n- How should the view layer be separated from the game logic layer?\n- What data structures should be used to store the cards?\n\nThis goal will especially exercise your [domain modeling](https://en.wikipedia.org/wiki/Domain_model) skills.\n\n## Specifications\n\n- [ ] App has one page that displays the full game\n- [ ] Deck has 81 shuffled cards\n- [ ] When launched, game deals 12 cards from deck in a 4x3 grid\n- [ ] Player has a score (starts at 0)\n- [ ] Player can press a button to reset the game\n  - [ ] When pressed, deck is regenerated and reshuffled and a new grid is dealt\n- [ ] Player can press a button to deal 3 more cards into the grid (now 5x3)\n- [ ] Player can click to select 3 cards and UI will indicate that the cards have been \"selected\"\n  - [ ] When the player selects 3 cards that _are_ a set, the cards are replaced with new ones and the player's score increments by 1\n  - [ ] When the player selects 3 cards that _are not_ a set, the player is shown a temporary error message (\"Not a set\") and the cards are automatically de-selected\n- [ ] When there are no more cards in the deck or remaining cards have no sets in them, game is over\n  - [ ] \"Game Over\" message is displayed\n  - [ ] \"New Game\" button is displayed, which starts a new game if clicked\n- [ ] Cards and their graphics are rendered with [CSS shape tricks](https://css-tricks.com/examples/ShapesOfCSS/) (not images)\n- [ ] The artifact produced is properly licensed, preferably with the [MIT license][mit-license].\n\n### Stretch\n\nAs a stretch goal, implement multiplayer Set. More than one player can play at once on the same deck.\n\n- [ ] Each player writes their own name when they join the game\n- [ ] Each player has a score on a scoreboard next to their name (starting at 0)\n- [ ] Once one player selects a card, the grid is frozen for other players\n  - [ ] Player has 5 seconds to select the two other cards\n  - [ ] Countdown timer is displayed to the selecting player\n  - [ ] If 5 seconds pass and they don't select all 3 cards, all their cards are de-selected and the grid is \"unfrozen\" (other players can select again)\n  - [ ] All players are notified of the player who is currently selecting (using their name)\n- [ ] When a player selects a set, all players are notified of who got the set with a temporary message\n- [ ] When game is over, scoreboard is displayed to all players\n\n## Quality Rubric\n\n**Separation of concerns**\n- Game logic is separated from the rendering logic. [100 points]\n\n**Well formatted code**\n- Code uses a linter, which can be invoked with a command (e.g. `npm run lint`). [50 points]\n- Running the linter on all source code files generates no linting errors. [50 points]\n\n**Clear and useful README**\n- Repository includes a README file with installation and setup instructions. [25 points]\n- Repository includes a README file with usage instructions and at least one example use case. [25 points]\n\n**Proper dependency management**\n- There is a command to install dependencies (e.g. `npm install`) and it is specified in the installation and setup instructions of the README. [50 points]\n\n**Good project management**\n- Commit messages are concise and descriptive. [25 points]\n- All features are added via pull requests. [25 points]\n- Every pull request has a description summarizing the changes made. [25 points]\n- Every pull request has been reviewed by at least one other person. [25 points]\n\n[mit-license]: https://opensource.org/licenses/MIT"
}