{
  "authors": [
    "tannerwelsh"
  ],
  "goal_id": 123,
  "team_size": 2,
  "title": "Core Algorithms",
  "created_at": "2016-12-29T16:52:48Z",
  "labels": [
    "core"
  ],
  "published": true,
  "level": "1",
  "redirect_from": "/goals/123",
  "url": "http://jsdev.learnersguild.org/goals/123-Core_Algorithms.html",
  "content": "# Core Algorithms\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can write programs and tests using Node.js and npm\n- Can use problem decomposition to split difficult problems into smaller parts\n- Have used pseudocode as an intermediary step in writing a program\n- Are interested in common computer science algorithms\n- Are interested in critical thinking and problem solving\n\n## Description\n\nWrite tests and implementations for algorithms commonly used in job interviews.\n\nFork the the [core-algorithms repository][core-algorithms] and use the fork as your project artifact.\n\nUse the list in the [algorithms.md][algorithms-list] file as a reference for each algorithm.\n\n## Context\n\nBeing able to design, implement, and test algorithms is a key skill for all programmers. Most of the algorithms you'll encounter on the job will not fall neatly into the set of \"common algorithms\" specified here, but will be new problems for which you will have to find new solutions and adapt existing ones.\n\nFor this reason, developing the ability to do **algorithmic thinking** is a high-value skill.\n\nIn addition, many job interview processes will include some algorithmic problem-solving component, and it is useful to be familiar with some of the most common problems and good approaches to find their solutions.\n\n## Specifications\n\n- [ ] Artifact produced is a fork of the [core-algorithms][core-algorithms] repo.\n- [ ] Can run all tests with `npm test`.\n- [ ] All tests are passing.\n- [ ] For each algorithm in the [algorithms list][algorithms-list], there exists:\n  - [ ] a test file with at least 2 unit tests using valid inputs, and at least 1 unit test using invalid inputs.\n  - [ ] an implementation file with a correct implementation of the algorithm.\n\n### Required\n\n- [ ] The artifact produced is properly licensed, preferably with the [MIT license][mit-license].\n\n### Stretch\n\nPick a _different_ programming language from JavaScript (e.g. Ruby, Swift, Python, C, Java...) and write tests & implementations for each.\n\n- [ ] Can run all non-JavaScript tests with a single command.\n- [ ] For each algorithm identified above, there exists:\n  - [ ] a test file with multiple unit tests for each algorithm  _in a language other than JavaScript_.\n  - [ ] an implementation file with a correct implementation of the algorithm _in a language other than JavaScript_.\n\n## Quality Rubric\n\n**Well formatted code**\n- Code uses a linter, which can be invoked with a command (e.g. `npm run lint`). [50 points]\n- Running the linter on all source code files generates no linting errors. [50 points]\n\n**Clear and useful README**\n- Repository includes a README file with installation and setup instructions. [25 points]\n- Repository includes a README file with usage instructions and at least one example use case. [25 points]\n\n**Proper dependency management**\n- There is a command to install dependencies (e.g. `npm install`) and it is specified in the installation and setup instructions of the README. [50 points]\n\n**Good project management**\n- Commit messages are concise and descriptive. [25 points]\n- All features are added via pull requests. [25 points]\n- Every pull request has a description summarizing the changes made. [25 points]\n- Every pull request has been reviewed by at least one other person. [25 points]\n\n[mit-license]: https://opensource.org/licenses/MIT\n[core-algorithms]: https://github.com/GuildCrafts/core-algorithms\n[algorithms-list]: https://github.com/GuildCrafts/core-algorithms/blob/master/algorithms.md"
}