{"authors":["tannerwelsh"],"teamSize":4,"issueNumber":125,"title":"Mock Interview Trials","createdAt":"2016-12-29T17:10:18Z","labels":["core"],"published":false,"level":"NONE","redirect_from":"/goals/125","content":"# Mock Interview Trials\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build full-stack web applications\n- Can contribute effectively on a team of web developers\n- Can write feature-complete, quality code\n- Can discuss and explain software using correct and precise technical terms\n- Have solved logic puzzles while verbalizing your thought process\n- Have used a whiteboard to diagram software systems\n- Are familiar with typical software engineering interview questions\n- Are interested in practicing being interviewed\n\n## Description\n\nPractice your interviewing skills with mock interview trials.\n\nFork the [interview-trials][interview-trials] repository and use the fork as your project artifact.\n\nTo complete this goal, each team member should conduct at least two interview trials with an interviewer. The rest of the time should be spent preparing for interviews and practicing common interview questions.\n\nAt the end of the project, submit the trial files for each interview conducted, along with the questions used, the interviewee reflection, and the interviewer's evaluation.\n\nIt is up to the interviewer to decide how they wish to conduct their interviews, but they should all use the same evaluation format provided in the repository.\n\n## Context\n\nUnfortunately, just being good at building software with a team is not enough to get hired as a software developer. The job interview is its own thing.\n\nIf you want to get a job, you'll need to _also_ be good at interviewing. This will mean different things for different companies, positions, and interviewers. There is no one question that they all ask, or one skill that they all look for.\n\nAs a result, the best way to prepare is to do \"mock\" interviews as a trial, with plenty of feedback from the interviewer. Not only will this give you practice answering questions and solving problems in an interview setting, but it will also help to demystify the interview process.\n\n## Specifications\n\n- [ ] Artifact produced is a fork of the [interview-trials][interview-trials] repo.\n- [ ] At least two completed mock interviews per team member, with all trial files added to `trials/`.\n- [ ] Trial files for interviews are complete, including:\n  - Questions asked\n  - Interviewee reflections\n  - Interviewer evaluation\n\n## Quality Rubric\n\n- Commit messages are concise and descriptive. [25 points]\n- All new questions/trials are added via pull requests. [25 points]\n- Every pull request has a description summarizing the changes made. [25 points]\n- Every pull request has been reviewed by at least one other person. [25 points]\n\n[interview-trials]: https://github.com/GuildCrafts/interview-trials"}