{
  "authors": [
    "tannerwelsh"
  ],
  "goal_id": 127,
  "team_size": 2,
  "title": "MetroRail: Web API Design, Building, and Documentation",
  "created_at": "2016-12-30T22:42:23Z",
  "labels": [
    "practice"
  ],
  "published": true,
  "level": "2",
  "redirect_from": "/goals/127",
  "url": "https://jsdev.learnersguild.org/goals/127-MetroRail-Web_API.html",
  "base_xp": 200,
  "bonus_xp": 30.0,
  "dynamic": false,
  "content": "# MetroRail: Web API Design, Building, and Documentation\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Have completed the [prerequisite challenge][metrorail-data-model]\n- Can build a web app using Node.js and npm\n- Can read and write JSON documents\n- Are familiar with HTTP verbs\n- Are interested in RESTful design\n- Are interested in web APIs\n\n## Description\n\nBuild an HTTP API for the data model/store from the [MetroRail: Data Modeling & Database Design][metrorail-data-model] goal. You need a working implementation of that goal before you can do this one.\n\nWhen complete, you'll have a web API for interacting with the fictional transit system. You'll be able to send HTTP requests, with a username and token provided for authentication, and receive a JSON response.\n\n```\n$ curl -u $USERNAME:$TOKEN -X GET http://localhost:4000/api/trains/\n{\n  \"status\": \"success\",\n  \"data\": [\n    {\n      \"number\": 1,\n      \"currentStationId\": 3,\n      \"capacity\": 20,\n      \"passengers\": [\n        {\n          \"id\": 19,\n          \"name\": \"Bill\"\n        },\n        {\n          ...\n        }\n      ]\n    },\n    {\n      ...\n    }\n  ]\n}\n```\n\n## Context\n\nWhenever you write code that may be used by someone besides you (which, hopefully, is most of the time), it is important to pay careful attention to the design of your code's _interface_.\n\nMost large-scale web applications provide a programmatic interface via HTTP so that the developer community can build tools and products on top of their services.\n\nPart of your skillset as a developer will necessarily involve _consuming_ an HTTP API, but just as important is knowing how to _produce_ an API.\n\nAs you build this project, you'll likely encounter questions such as:\n\n- Which endpoints should the API offer?\n- Which endpoints should be public? Which endpoints protected by authentication?\n- What is the shape of the data that should be returned?\n- Where should this code live to keep the codebase organized and well-structured?\n- How should authentication work?\n- When and why should error messages be returned?\n- Where and why is the code vulnerable to attack or performance stress?\n- What tools and/or standards should I use when producing documentation?\n\n## Specifications\n\n#### Commands\n\nExpose the following commands (and more, if you need) using the `scripts` property of your `package.json`.\n\n- [ ] `$ npm run test`: run all tests.\n- [ ] `$ npm run start`: start a web server for the API (at `/api`).\n- [ ] `$ npm run docs`: generate documentation for the API and/or start a server for rendering the docs (you can use something like http://apidocjs.com/).\n\n#### User Stories\n\nCreate models with interfaces to satisfy the following user stories, assuming the \"user\" in this case is a programmer consuming your web API.\n\n##### GET Requests\n- [ ] As a user of the API, I can receive a list of all trains with a `HTTP GET` request.\n- [ ] As a user of the API, I can receive a list of all stations with a `HTTP GET` request.\n- [ ] As a user of the API, I can receive a list of all passengers with a `HTTP GET` request.\n- [ ] As a user of the API, I can find trains by number or their next station with a `HTTP GET` request.\n- [ ] As a user of the API, I can find stations by location or ID with a `HTTP GET` request.\n- [ ] As a user of the API, I can find passengers by name, train, or current location with a `HTTP GET` request.\n\n##### POST Requests\n- [ ] As a user of the API, I can create a new train with a `HTTP POST` request.\n- [ ] As a user of the API, I can create a new station with a `HTTP POST` request.\n- [ ] As a user of the API, I can create a new passenger with a `HTTP POST` request.\n\n##### PUT/PATCH Requests\n- [ ] As a user of the API, I can update a train with a `HTTP PUT` or `PATCH` request.\n- [ ] As a user of the API, I can update a station with a `HTTP PUT` or `PATCH` request.\n- [ ] As a user of the API, I can update a passenger with a `HTTP PUT` or `PATCH` request.\n\n##### DELETE Requests\n- [ ] As a user of the API, I can delete a train with a `HTTP DELETE` request.\n- [ ] As a user of the API, I can delete a station with a `HTTP DELETE` request.\n- [ ] As a user of the API, I can delete a passenger with a `HTTP DELETE` request.\n\n##### Errors\n- [ ] As a user of the API, I receive appropriate and descriptive error messages.\n\n#### Design & Architecture\n\n- [ ] All API endpoints follow a RESTful design approach.\n- [ ] Files are organized and named demonstrating clear separation of concerns: web server, routing, data model, database connection/adapter, tests, etc.\n- [ ] Authentication is enforced for all write operations.\n- [ ] Authentication is enforced for some read operations (you determine which data should be unprotected and publicly available).\n- [ ] Documentation produced is accurate and easily referenced.\n- [ ] HTTP responses use the correct status code header.\n- [ ] HTTP responses use the correct content type header.\n\n#### General\n\n- [ ] Repository includes a README file with basic installation and setup instructions.\n- [ ] All package dependencies are properly declared in `package.json`.\n- [ ] All major features are added via pull requests with a clear description and concise commit messages.\n- [ ] Code uses a linter and there are no linting errors.\n- [ ] Variables, functions, files, etc. have appropriate and meaningful names.\n- [ ] There are unit tests that exercise the specs for every route defined.\n- [ ] There are behavior (or end-to-end) tests that exercise use cases in their entirety.\n- [ ] The artifact produced is properly licensed, preferably with the [MIT license][mit-license].\n\n### Stretch\n\nBuild an alternate API using [GraphQL](http://graphql.org/) and serve it at the route `/graphql`.\n\n- [ ] All data and actions accessible via `/api` are possible via `/graphql`.\n\n[mit-license]: https://opensource.org/licenses/MIT\n[metrorail-data-model]: ./126-MetroRail-Data_Modeling.md"
}