{"authors":["bundacia"],"team_size":2,"goal_id":143,"title":"Apprentice on the LOS team","created_at":"2017-01-27T21:43:35Z","labels":["production"],"published":true,"level":"4","redirect_from":"/goals/143","url":"http://jsdev.learnersguild.org/goals/143-Apprentice_with_the_LOS_Team.html","content":"# Apprentice with the LOS Team\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build full-stack web applications with Node.js and npm\n- Can write feature-complete, fully tested, quality code\n- Can debug programs in both client- and server-side environments\n- Can track and manage work using a project management tool\n- Can collaborate effectively on a living codebase\n- Can build, deploy, and maintain a web app with real users\n- Are familiar with a variety of libraries and frameworks\n- Are familiar with several databases and their tradeoffs\n- Are interested in contributing to a large, real-world web application\n- Are interested in using professional project management processes and tools\n\n## Description\n\nJoin the LOS team to build the software that we use every day at Learners Guild.\n\nUnder the direction of one of the LOS Software Engineers, work on features or bugfixes from the backlog.\n\nYou will need to get the LOS apps running locally if you haven't already.\n\n- https://github.com/LearnersGuild/idm\n- https://github.com/LearnersGuild/game\n- https://github.com/LearnersGuild/graphiql\n\nFollow the instructions in the README for each repo, starting with [IDM](https://github.com/LearnersGuild/idm).\n\n## Context\n\nThis is the real deal.\n\nYou'll be working on real issues that really need to ship on a real app with real users. You'll be doing a mix of pairing with your team and doing cognitive apprenticeship with one of the LOS Software Engineers.\n\nYou should choose this goal if you are ready to try being part of a team working on a complex system of interconnected apps with real users and constraints. Be ready to adapt to changing circumstances and new challenges.\n\n## Specifications\n\nSpecifications and requirements will come from LOS story tickets in [Clubhouse](https://app.clubhouse.io/learnersguild/) (the LOS issue tracking system).\n\n## Quality Rubric\n\nQuality requirements will be determined by the nature of the work you take on. No code will be merged without first being reviewed, and you can expect a high bar for quality."}