{
  "authors": [
    "shereefb"
  ],
  "goal_id": 176,
  "team_size": 2,
  "title": "Core Vanilla JavaScript [Team Drills & Practice]",
  "created_at": "2017-02-20T23:03:19Z",
  "labels": [
    "core",
    "practice"
  ],
  "published": true,
  "level": "1",
  "redirect_from": "/goals/176",
  "url": "http://jsdev.learnersguild.org/goals/176-Core_Vanilla_JavaScript-Team_Drills.html",
  "content": "# Core Vanilla JavaScript [Team Drills & Practice]\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can open, edit, and save files with a text editor\n- Can use a web browser to search, explore, and consume content from the Internet\n- Are familiar with the concept of programs as instructions for a computer\n- Are beginning to write correct JavaScript and understand its syntax\n- Are getting started reading and writing JavaScript control structures, basic functions, and data types\n- Are interested in strengthening your knowledge of and fluency with JavaScript\n\n## Description\n\nA day-by-day structured set of challenges to be completed in team.\n\nThe final 2 days consist of a final project that demands and develops all your JavaScript foundational skills and stretches problem solving skills.\n\nFork the the [core-vanilla-javascript repository][core-vjs] and use the fork as your project artifact.\n\nIn the [team_practice.md][core-vjs-team] you'll find that this goal is broken down into daily objectives and tasks in order to support you in pacing yourself. There are a ton of stretch goals at the end, so make sure to go with the recommended pace or faster to get the most out of it.\n\n## Context\n\nBefore getting started building web applications, it's important to get a grounding into the basics of programming and JavaScript. Becoming a full stack web developer means that you need to be comfortable with the core language first, before using it in the web stack.\n\nChoose this goal if you're just getting started with the basics of JavaScript and programming and want to gain a solid foothold. This will be an immersive, intensive, and highly structured study.\n\n## Specifications\n\n- [ ] Artifact produced is a fork of the [core-vjs][core-vjs] repo.\n- [ ] All readings and videos in the [team_practice.md][core-vjs-team] are completed and checked off.\n- [ ] All exercises and lessons in the [team_practice.md][core-vjs-team] are completed and checked off.\n- [ ] Final project is complete and in the proper directory of the artifact.\n\n_Note: Make sure to check off your progress and push your repo to GitHub at least twice a day._\n\n### Stretch\n\n- [ ] All stretch tasks in the [team_practice.md][core-vjs-team] are completed.\n\n## Quality Rubric\n\n**Clean code and commit messages**\n- Code is well formatted with proper spacing and indentation. [40 points]\n- Descriptive, well-named functions, variables, files, CSS classes, etc. [40 points]\n- Commit messages are concise and descriptive. [20 points]\n\n[core-vjs]: https://github.com/GuildCrafts/core-vanilla-javascript\n[core-vjs-team]: https://github.com/GuildCrafts/core-object-oriented-javascript/blob/master/team_practice.md"
}