{
  "authors": [
    "shereefb"
  ],
  "goal_id": 181,
  "team_size": 2,
  "title": "Timeoff Snapshot - Approver Epic",
  "created_at": "2017-02-21T22:26:48Z",
  "labels": [
    "snapshot"
  ],
  "published": true,
  "level": "2",
  "redirect_from": "/goals/181",
  "url": "http://jsdev.learnersguild.org/goals/181-Timeoff_Snapshot-Approver_Epic.html",
  "base_xp": 200,
  "dynamic": false,
  "content": "# Timeoff Snapshot [Approver Epic]\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Have built simple CRUD apps with node.js\n- Interested in tackling a bigger challenge involving a more complex codebase\n- Have some familiarity with testing web apps\n- Are familiar with Handlebar syntax\n- Are familiar with cookies and sessions\n\n## Description\n\nWork on an existing open-source codebase!\n\nThis is the first in a series of two snapshot goals. The next is [Timeoff Snapshot [International Epic]][timeoff-2].\n\nThis repo is a Timeoff Manager ([original repo](https://github.com/timeoff-management/application) | [live site](http://timeoff.management/)) which is used by small to medium sized companies to manage requests for time off by it's employees.\n\n### Getting Started\n\n1. The first step of approaching any new codebase is to read the [README][repo-readme].\n1. Get the code up and running. Checkout the [README][repo-readme] and look for instructions to get a local development copy of the repo up and running and play around with it.\n1. Read the browse in the `t` directory. Reading test descriptions (and file names) is a great way to learn what the app can do.\n1. Run all the tests locally, to make sure they are passing. (for this repo, there will be several failing tests) Use the `npm test` command.\n1. Inspect the [database design][repo-db-design]. Load it up in [sql designer](http://sql.apps.learnersguild.org/) and familiarize yourself with the schema.\n1. Finally, look around the other folders and get a sense of how the code is organized, and what the technology stack is: database? front end? test suite? asset management? CSS framework?\n\n## Context\n\nA snapshot goal is based on a medium-to-large-sized repo that is \"frozen\" in time. It's meant to simulate the experience of developing a feature for an existing \"live\" open source project.\n\nUse snapshot goals to learn about working with larger code bases, and getting a simulated experience of being in a live sprint to push a set of features across the finish line.\n\nHaving learned the basics of CRUD apps, you'll spend as much time reading code as writing it, and having to design creative solutions within a legacy codebase.\n\n## Specifications\n\n**Epic 1: Approver User Role**\n\nThis epics adds a new role: approver. Approvers can approve and reject requests, but don't have all of the admin access that an admin has.\n\n- [ ] As an Admin when I add a new user, I can choose to make them an approver.\n- [ ] As an Admin if I try to make someone an approver AND an admin I get an error: \"User can only be approver or admin, not both\".\n- [ ] As an approver I can see a menu item in the top navbar next to calendar called \"Requests\" which links to `/requests`.\n- [ ] As an admin I can see the requests link as well.\n- [ ] As an employee without the approver role, I cannot see the requests.\n- [ ] As an approver or admin, I can see a notification icon next to the request link that shows the number of pending requests.\n- [ ] As an approver, I can approve and reject requests.\n- [ ] As an approver, I do not have access to other admin functions (general, department, LDAP configuration, emails audit).\n\n**General**\n\n- [ ] Artifact is a fork of the [Timeoff.Management][repo] repo.\n- [ ] Practice an Agile approach to developing this epic:\n  - All user stories are added as issues on GitHub in your fork of timeoff.management and tracked there.\n  - Start a [project](https://help.github.com/articles/about-projects/) in GitHub, add all user stories to it, and drag one issue at a time from the `backlog` to `in progress`.\n  - Every user story should be in its own clean pull request, with unit and integration tests included. PRs can include one or more user stories, but user stories should _not_ span multiple PRs (don't solve one user story with 2+ PRs).\n  - Practice a daily standup with your pair: \"what we worked on yesterday, what we are accomplishing today, what's blocking\".\n- [ ] All major features are added via pull requests with a clear description and concise commit messages.\n- [ ] Code uses a linter and there are no linting errors.\n- [ ] Code is well formatted with proper spacing and indentation.\n- [ ] Where appropriate, comments explain unusual code, bug fixes, code assumptions.\n- [ ] Variables, functions, files, etc. have appropriate and meaningful names.\n- [ ] Methods are grouped logically or by accessibility. Basic separation of code into logical folders.\n\n### Stretch\n\n**Epic 2: Backend User Role**\n\nThis epic adds a new role: backend user. Backend users can access general admin functions, but can't approve/reject requests.\n\n- [ ] As an Admin when I add a new user, I can choose to make them a 'backend user'.\n- [ ] As an Admin if I try to make someone a 'backend user' AND an admin I get an error: \"User can only be a 'backend user' or admin, not both\".\n- [ ] As a Backend user, I can't see the 'Requests' menu item but I can see a menu item 'My Requests', which links to `/requests`.\n- [ ] As a Backend user, when I browse `/requests` I see only my personal requests, not the admin/approver view.\n- [ ] As a Backend user, I have access to other admin functions (general, department, LDAP configuration, emails audit).\n\n## Resources\n\nThe inspiration project:\n\n- [Timeoff Manager](https://github.com/timeoff-management/application) (original repo)\n- [Timeoff Manager](http://timeoff.management/) (live app)\n\nUsing Sequelize:\n\n- [Sequelize docs: getting started](http://docs.sequelizejs.com/en/latest/docs/getting-started/)\n- [Tutorial on Sequelize + Node.js + Express + PostgreSQL](https://scotch.io/tutorials/getting-started-with-node-express-and-postgres-using-sequelize) (there will be some differences between PostgreSQL and the databases in this goal, so take everything with a grain of salt)\n- Treehouse workshop: [Using SQL with Node.js & Sequelize (44m)](https://teamtreehouse.com/library/using-sql-and-nodejs-with-sequelize)\n\n[repo]: https://github.com/GuildCrafts/timeoff.management/\n[repo-readme]: https://github.com/GuildCrafts/timeoff.management/blob/master/README.md\n[repo-db-design]: https://github.com/GuildCrafts/timeoff.management/blob/master/docs/db_design.txt\n\n[timeoff-2]: {{ site.url }}{% link _goals/182-Timeoff_Snapshot-International_Epic.md %}"
}