{"authors":["tannerwelsh"],"teamSize":1,"issueNumber":195,"title":"Level Up Your Environment","createdAt":"2017-03-09T11:00:00Z","labels":["core"],"level":"1","published":true,"redirect_from":"/goals/195","content":"# Level Up Your Environment\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can use a terminal & shell to interact with and navigate the filesystem\n- Can use Google to find relevant learning resources\n- Are familiar with package managers like npm\n- Are interested in improving and configuring your development environment\n- Are interested in getting involved with the software development community\n\n## Description\n\nImprove your development environment - both on your computer and in the social world of software development!\n\nIn this goal, you'll complete a set of mini-projects to help you **level up** your **computer's development environment** and **get involved** with your local (and online) **developer community**.\n\nYou'll get to do things like contribute to an open source project, discover interesting conferences, create your own `dotfiles` repo, and improve your editor skills.\n\n### Mini-Projects\n\nEach of these mini-projects should take between 2-6 hours. The output of each mini-project will vary based on the type of project. Make sure to include a link to each output in your artifact.\n\nYou can do them in any order. It's recommended that you mix up the `Community` and `DevEnv` mini-projects, but do your own thing. :)\n\nAfter you complete each project, consider sharing your findings/learnings with other learners! Lots of people will likely benefit from what you discover.\n\n#### Find and Join some Meetups and Workshops [Community]\n\n[Meetups][meetup] are a great way to connect with other people in your industry, learn about new projects and technologies, share knowledge, and find work opportunities. Workshops can also be good places to learn a new skill and build community, but sometimes they can be costly.\n\n**Output:** compile a list of good Meetups and/or workshops with links. If you attend any of them, include your thoughts/reflections.\n\n#### Find and Follow Industry Thought Leaders [Community]\n\nDiscover interesting folks to follow on Twitter, Medium, and other social media sites. This is a good way to find inspirational folks and maybe even make a new friend or two. :)\n\nTo get you started, here are a few folks from my list that I'd recommend: [Anil Dash](https://twitter.com/anildash), [Erica Joy](https://twitter.com/EricaJoy), and [Vanessa Hurst](https://twitter.com/DBNess).\n\n**Output:** compile a list of interesting people to follow, along with links to their social media profile(s).\n\n#### Discover Industry Conferences [Community]\n\nSome love them, some hate them, but for better or worse conferences are a big part of the social sphere in tech and they can be a good place to meet people and build community. Unfortunately, many conferences are really expensive. However, companies are often willing to fund their employees to go to conferences. Some conferences even offer discounts and scholarships for people who would otherwise not be able to attend.\n\nHere are few good conferences I'm aware of (haven't had the chance to attend, but I've heard good things from trusted people): [AlterConf](https://alterconf.com/), [Strange Loop](http://www.thestrangeloop.com/), and [Women Techmakers](https://www.womentechmakers.com/).\n\n**Output:** compile a list of relevant and useful conferences. If you attend any of them, include your thoughts/reflections.\n\n#### Contribute to Open Source [Community]\n\nFind an open source project that you are interested in, fork it, pick an open issue, resolve it, and then open a pull request.\n\nGetting started with open source can be a bit daunting or intimidating, but luckily there are lots of good resources out there to help you out. Check out the links in the [Open Source](#open-source) section of the [Resources](#resources).\n\n**Output:** make a pull request on an open-source project. Link to the PR in your artifact.\n\n#### Make Your Own Dotfiles [DevEnv]\n\nDotfiles are usually configuration files for things like your shell, languages, and packages. Many developers keep all their dotfiles organized in one repo.\n\nCheck out the links in the [Dotfiles & Environment Management](#dotfiles-environment-management) section of the [Resources](#resources) for more information and lots of examples of other dotfiles repos. One way to go is to fork a dotfiles repo that you like, and then customize it according to your preferences.\n\n**Output:** create a dotfiles repo in your personal GitHub account. Link to the repo in your artifact.\n\n#### Setup Homebrew and Install Some Packages [DevEnv]\n\n[Homebrew][homebrew] is a useful tool for managing software and packages/libraries on a Mac. If you don't have it already, set it up!\n\nThen, use the [homebrew-bundle][homebrew-bundle] package to create your own `Brewfile` to keep track of all your installed Homebrew packages. You may want to add this file to your `dotfiles` repo.\n\n**Output:** create a `Brewfile` and add your favorite Homebrew packages to it.\n\n#### Find and Install Editor Plugins [DevEnv]\n\nIf you aren't using a code editor that allows for plugins or extensions, you're missing out. The best editors have a plugin system so that developers can extend them to do all kinds of nifty things.\n\nCheck out the links in the [Editor Extensions and Plugins](#editor-extensions-and-plugins) section of the [Resources](#resources) to find packages for your editor of choice.\n\n**Output:** compile a list of your favorite editor plugins.\n\n#### Build an Atom Package (Stretch) [DevEnv]\n\nThe Atom editor has a robust package management system built-in. And, you can write them in JavaScript. :smile:\n\nIf you don't have an idea for a package that you'd like to build, you could find one that you like and reverse-engineer it. Also, you could do this [tutorial on building an Atom plugin][tutorial-atom-plugin].\n\n**Output:** create an Atom package and publish as a repo on your personal GitHub account.\n\n## Context\n\nThis goal is a mash-up of two things that are not directly related, but they do share a focus on situating yourself in your environment.\n\nLike most industries, the social environment of web and software development is complex. Sometimes, it can be intimidating to know how to engage with other developers to make connections, create a network, and find mentorship or support. Also, the tech industry in the US has plenty of problems with systematic discrimination in the form of racism, sexism, classism, ablism, cissexism, and others.\n\nFiguring out how to find and build a supportive, nurturing, and safe community within the industry is important for all web developers at the start of their career. This goal is intended to help you better orient and understand the larger community and to find out how and where to make your place within it.\n\nThe other, more technical part of this goal is focused on your code environment (not so social :). As a web developer, your computer is primary workspace. The tools you use every day: the editors, terminal programs, and packages make up your development environment, shaping how you work and what you are able to do.\n\nIt is important to know how to configure this environment and continuously modify and upgrade it so that your workspace works _for_ you. Just like carpenters have to keep their shop clean and their tools organized in order to work most effectively, web developers must do the same with their space and tools.\n\n## Specifications\n\n- [ ] Artifact produced is a gist of links to the various mini-projects.\n- [ ] Artifact includes links to all mini-project outputs:\n  - [ ] List of good Meetups and/or workshops with links and any thoughts/reflections after attending.\n  - [ ] List of interesting people to follow with links to their social media profile(s).\n  - [ ] List of relevant and useful conferences and any thoughts/reflections after attending.\n  - [ ] Pull request on an open-source project.\n  - [ ] Dotfiles repo.\n  - [ ] `Brewfile` with favorite Homebrew packages.\n  - [ ] List of your favorite plugins for your editor of choice.\n- [ ] The artifact produced is properly licensed, preferably with the [MIT license][mit-license].\n\n### Stretch\n\n- [ ] Your own custom Atom package is built and linked from the artifact.\n\n## Quality Rubric\n\n- Code in dotfiles repo is well formatted and readable [50 points]\n- All text files are well organized and easily readable even in their raw format. [50 points]\n\n## Resources\n\n### Open Source\n\n- [List of projects which have curated tasks specifically for new contributors][up-for-grabs]\n- Guide: [\"How to get started with Open Source\"][how-to-get-started-with-open-source]\n- [A list of awesome beginners-friendly projects][awesome-for-beginners]\n- Quora question: [\"What's a good open source project on GitHub for beginners to contribute to?\"][quora-open-source-for-beginners]\n- [First Timers Only][firsttimersonly]\n\n### Dotfiles & Environment Management\n\n- [GitHub's unofficial guide to Dotfiles][github-dotfiles] includes lots of examples\n- Guide: [Getting Started With Dotfiles][guide-getting-started-with-dotfiles]\n- Guide: [Managing Your Dotfiles][guide-managing-your-dotfiles]\n\n### Editor Extensions and Plugins\n\n- Official site for [Atom Packages][atom-packages]\n- [Vim Awesome][vim-awesome] aggregates the best packages for Vim\n- [Package Control][packagecontrol] is the best package manager for Sublime\n- [Awesome Emacs][awesome-emacs] is a \"community driven list of useful Emacs packages, libraries and others\"\n- [Tutorial on building an Atom package][tutorial-atom-plugin]\n\n[meetup]: http://www.meetup.com/\n\n[firsttimersonly]: http://www.firsttimersonly.com/\n[up-for-grabs]: http://up-for-grabs.net/\n[how-to-get-started-with-open-source]: https://www.hackerearth.com/getstarted-opensource/\n[awesome-for-beginners]: https://github.com/MunGell/awesome-for-beginners\n[quora-open-source-for-beginners]: https://www.quora.com/Whats-a-good-open-source-project-on-GitHub-for-beginners-to-contribute-to\n\n[github-dotfiles]: https://dotfiles.github.io/\n[guide-getting-started-with-dotfiles]: https://medium.com/@webprolific/getting-started-with-dotfiles-43c3602fd789#.q74fitqmk\n[guide-managing-your-dotfiles]: http://www.anishathalye.com/2014/08/03/managing-your-dotfiles/\n\n[vim-awesome]: http://vimawesome.com/\n[atom-packages]: https://atom.io/packages\n[packagecontrol]: https://packagecontrol.io/\n[awesome-emacs]: https://github.com/emacs-tw/awesome-emacs\n[tutorial-atom-plugin]: https://github.com/blog/2231-building-your-first-atom-plugin\n\n[homebrew]: https://brew.sh/\n[homebrew-bundle]: https://github.com/Homebrew/homebrew-bundle\n\n[mit-license]: https://opensource.org/licenses/MIT"}