{
  "authors": [
    "tannerwelsh"
  ],
  "team_size": 2,
  "goal_id": 196,
  "title": "Dive Into UNIX and Bash",
  "created_at": "2017-03-09T11:00:00Z",
  "labels": [
    "core"
  ],
  "level": "1",
  "published": true,
  "redirect_from": "/goals/196",
  "url": "http://jsdev.learnersguild.org/goals/196-Dive_Into_UNIX_and_Bash.html",
  "content": "# Dive Into UNIX and Bash\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can open a shell session using a terminal emulator like the Terminal app or iTerm\n- Can navigate the filesystem on your computer\n- Are familiar with the concept of an operating system\n- Are interested in the UNIX family of operating systems\n- Are interested in learning how to use your terminal more effectively\n- Are interested in being able to write and use shell scripts\n\n## Description\n\nLearn how to navigate your UNIX system like a pro and write scripts with the popular bash scripting language. If you'd like to learn more about how to interact with your operating system and automate common tasks, this is a good goal for you.\n\nThis goal will take you through two free online books/tutorials and associated exercises:\n\n- Michael Hartl's book [\"Learn Enough Command Line to be Dangerous\"][hartl-command-line]\n- Ryan Chadwick's Tutorial on [Bash Scripting][ryans-tutorial-bash-scripting]\n\nThere are lots of exercises and activities in each of the books for you to work with. You only have to choose 20 from each book/tutorial to complete the goal. **Choose the ones that most interest you and are closest to your ZPD**. Some may be too easy, others too difficult.\n\nIf you're really keen, consider doing the stretch specs.\n\n_Note: while the \"Learn Enough Command Line\" book is free to read online, you have to buy a copy in order to gain access to the official solutions._ 😞 _However, this nice person [put their solutions up](https://github.com/scottjoseph/cmd-exercises), in case you're interested in referencing._\n\n## Context\n\nThe *nix family of operating systems (that is, anything in the UNIX or Linux families, like Mac OS X or Ubuntu) are the [most popular in the world of web development](http://stackoverflow.com/insights/survey/2016#technology-desktop-operating-system). Whether you are looking to be able to use and navigate your own local system or a remote server, knowing the basic commands is really important.\n\nThen you have the [shell][wiki-shell]. [Bash][wiki-bash] is a common one that ships with all Apple computers, but there are others: [zsh][zsh], [csh][csh], and [fish][fish] (yes, it's called `fish`). While this goal only focuses on bash, you may be inspired to try out other shells.\n\nAs you work through the books and exercises, you'll may encounter questions like the following:\n\n- What is the difference between the user and the system?\n- What happens when an executable script is invoked?\n- What is a shell, a terminal, and an operating system, and how do they interact?\n- How is a filesystem organized?\n- What are file permissions and how do they work?\n- What is the `PATH` and how is it used?\n- What is a process?\n\nIndulge your curiousity and explore the questions that pique your interest.\n\n## Specifications\n\n- [ ] Artifact is a GitHub repo.\n- [ ] 20 exercises are completed from the [\"Learn Enough Command Line to be Dangerous\"][hartl-command-line] book.\n  - [ ] Solution code for each exercise is included in its own bash file (*.sh).\n  - [ ] Solution code for exercises are stored in a `command-line/` directory of your artifact repo.\n  - [ ] Solution code for each exercise includes a comment with the prompt text for the exercise.\n- [ ] 20 activities are completed from the [Bash Scripting][ryans-tutorial-bash-scripting] tutorials.\n  - [ ] Solution code for each activity is included in its own bash file (*.sh). **Tip**: for the bash-scripting tutorials, check your solutions by executing your bash (.sh) files (type their name in the terminal), instead of writing code directly in the terminal.\n  - [ ] Solution code for activities are stored in a `bash-scripting/` directory of your artifact repo.\n  - [ ] Solution code for each activity includes a comment with the prompt text for the activity.\n- [ ] Cheat sheet of your favorite useful commands and a brief explanation of what they do is included in the artifact as a `cheat-sheet.md` file.\n- [ ] The artifact produced is properly licensed, preferably with the [MIT license][mit-license].\n\n### Stretch\n\n- [ ] All exercises are completed from the [\"Learn Enough Command Line to be Dangerous\"][hartl-command-line] book and solution code is included as files under a `command-line/` directory.\n- [ ] All activities are completed from the [Bash Scripting][ryans-tutorial-bash-scripting] tutorials and solution code is included as files under a `bash-scripting/` directory.\n- [ ] 10 activities are completed from the [Linux][ryans-tutorial-linux] tutorials and solution code is included as files under a `linux/` directory.\\*\n\n\\*Note: there will likely be overlap between this tutorial and the Hartl book. Choose only activities that cover new material so you don't do redundant work.\n\n## Quality Rubric\n\n**Clean and clear code**\n- Code is well formatted and easily readable [50 points]\n- Code includes comments where appropriate to explain and give context [50 points]\n\n**Good project management**\n- Commit messages are concise and descriptive. [25 points]\n- All features are added via pull requests. [25 points]\n- Every pull request has a description summarizing the changes made. [25 points]\n- Every pull request has been reviewed by at least one other person. [25 points]\n\n## Resources\n\n- Michael Hartl's book [\"Learn Enough Command Line to be Dangerous\"][hartl-command-line]\n- Ryan Chadwick's Tutorial on [Bash Scripting][ryans-tutorial-bash-scripting]\n- Ryan Chadwick's Tutorial on [Linux][ryans-tutorial-linux]\n- University of Hawaii article on [Advanced Unix][uhi-advanced-unix]\n- Codecademy's [Command Line course][codecademy-command-line]\n\n[mit-license]: https://opensource.org/licenses/MIT\n\n[hartl-command-line]: https://www.learnenough.com/command-line-tutorial\n[ryans-tutorial-bash-scripting]: http://ryanstutorials.net/bash-scripting-tutorial/\n[ryans-tutorial-linux]: http://ryanstutorials.net/linuxtutorial/\n[uhi-advanced-unix]: http://www.hawaii.edu/itsdocs/cen/unxadv.pdf\n[codecademy-command-line]: https://www.codecademy.com/learn/learn-the-command-line\n[wiki-shell]: https://en.wikipedia.org/wiki/Shell_(computing)\n[wiki-bash]: https://en.wikipedia.org/wiki/Bash_(Unix_shell)\n[zsh]: http://www.zsh.org/\n[csh]: https://en.wikipedia.org/wiki/C_shell\n[fish]: https://fishshell.com/"
}