{
  "authors": [
    "tannerwelsh"
  ],
  "goal_id": 231,
  "team_size": 2,
  "title": "Trossello Snapshot: Activity & Comments Epic",
  "created_at": "2017-03-22T17:10:48Z",
  "labels": [
    "snapshot"
  ],
  "published": true,
  "level": "2",
  "redirect_from": "/goals/231",
  "url": "http://jsdev.learnersguild.org/goals/231-Trossello_Snapshot-Activity_and_Comments_Epic.html",
  "xp_value": 200,
  "dynamic": false,
  "content": "# Trossello Snapshot: Activity & Comments Epic\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build CRUD apps from scratch with Node.js and PostgreSQL\n- Can use React to build stateful client-side applications\n- Have worked with SASS stylesheets\n- Have worked on a snapshot goal and/or with the Trossello codebase\n- Are familiar with SQL and SQL query writers like Knex.js\n- Are interested in working within a more complex, real-world codebase\n\n## Description\n\nStarting at commit [`7130f29`][starting-commit], implement **card comments and activity** in the [Trossello][trossello] app.\n\nIf you are **new to snapshot goals or to the Trossello app**, you may want to try a slightly easier one first, like the [Labels Epic][labels-epic]. Read the [Context](#context) section to learn whether this project will be right for you.\n\nTo complete this goal, you'll have to implement two new features: cards having comments, and cards having an activity feed.\n\nThese features are visible in the Trello app (try it out for yourself to see!), but in this snapshot of Trossello they have not yet been implemented.\n\nCard comments are where conversations happen about a particular card. Comments are displayed in an activity section of the card in reverse sequential order (newest comment on top).\n\nThe activity section also includes other events about the card: when the card was created, when it moves between lists, when members were added or removed to it, etc.\n\nNote that the _board_ itself already has an activity section (look in the board menu). If you're not sure how to get started implmenting card activity, this is a good place to start :).\n\nUse the real Trello app and the mockups below to guide your design and development process.\n\n### Setting Up Your Snapshot\n\n1. Fork & clone the [Trossello repo][trossello]\n1. Create and checkout a new branch for this goal, something like `activity-and-comments`\n  ```\n  $ git checkout -b activity-and-comments\n  ```\n1. Use `git reset --hard` to revert your local repo to the [starting commit][starting-commit]\n  ```\n  $ git reset --hard 7130f2911389e60f8e2a8f3efec6a03a135a1c0f\n  ```\n1. Push your branch to the remote repo on GitHub\n  ```\n  $ git push -u origin activity-and-comments\n  ```\n1. Get started on the specs!\n\n### Mockups\n\nTry to mimic the following mockups as closely as you can.\n\n#### Card With Activity\n\n<img alt=\"card-with-activity\" src=\"https://cloud.githubusercontent.com/assets/709100/24225050/d1939402-0f34-11e7-9f64-9e41f51f77f5.png\" width=\"800px\">\n\n#### Card Without Comments\n\n<img alt=\"card-without-comments\" src=\"https://cloud.githubusercontent.com/assets/709100/24225051/d196334c-0f34-11e7-8b5d-86280e621905.png\" width=\"800px\">\n\n\n## Context\n\n[Trossello][] is a clone of the popular kanban software [Trello](https://trello.com/). It is built entirely by Learners Guild learners and staff.\n\nA **snapshot goal** is meant to simulate the experience of developing a feature for an existing project.\n\nYou will have to orient yourself to the codebase, its idioms and architecture, and whichever tools you'll need to implement the feature. This involves reading a lot of code. To succeed, you'll need to figure out how the code works first before you begin to add to it.\n\nAs a professional web developer, you will rarely be building a project from the ground up, touching only code that _you_ have written. More often than not, you'll be contributing to a large, shared codebase with lots of legacy code. Not everything will make sense. You can't just start writing code any way you want - you have to learn how to integrate with the existing code.\n\n_If you've never done a snapshot goal before_, this one may not be the best place to start as it is significantly challenge. You may want to try a slightly easier one first, like the [Trossello Snapshot - Labels Epic][labels-epic].\n\nThis particular snapshot (not the stretch specs though) roughly mimics the work done in this [pull request][example-pr]. When you are done implementing your solution, take a look at the code there to see how closely it matches your solution.\n\n## Specifications\n\n- [ ] Users can comment on cards\n- [ ] Cards have an activity feed\n- [ ] Comments are rendered in the activity feed\n- [ ] The activity feed includes items for each of the following types of events:\n  - [ ] Card is created\n  - [ ] Card is archived\n  - [ ] Card is unarchived\n  - [ ] Card is moved from one list to another\n- [ ] Activity feed items are rendered in reverse sequential order (most recent item on top)\n- [ ] Users can edit comments\n- [ ] Users can delete comments\n- [ ] Tests exist for each of the above specs\n- [ ] UI looks the same as in the mockups\n- [ ] The artifact produced is a fork of the [Trossello][trossello] repository\n- [ ] All major features are added via pull requests with a clear description and concise commit messages.\n- [ ] Code uses a linter and there are no linting errors.\n- [ ] Variables, functions, files, etc. have appropriate and meaningful names.\n\n### Stretch\n\n- [ ] Activity feed items show when they were created\n  - [ ] If they were created less than 24 hours previously, shows creation time as `X minutes/hours ago`, e.g. `18 minutes ago` or `8 hours ago`\n  - [ ] If they were created less than 24 hours previously, shows creation time as `<month> <day> at <time>`, e.g. `Jan 28 at 4:32pm`\n- [ ] Edited comments show that they have been edited with an `(edited)` text appearing next to their creation time\n- [ ] The activity feed includes items for each of the following types of events:\n  - [ ] Card title is changed\n  - [ ] Card description is changed\n  - [ ] Label is added to card\n  - [ ] Label is removed from card\n  - [ ] Due date is added\n  - [ ] Due date is changed\n  - [ ] Due date is removed\n- [ ] Users can toggle between a \"detailed\" activity feed (all events) and a \"comments only\" activity feed (only comments)\n- [ ] Users can use Markdown syntax in card comments\n- [ ] Card comments written with Markdown syntax are rendered correctly in the activity feed\n\n## Resources\n\n- [React][react]\n- [knex.js][knex]\n\n[react]: https://facebook.github.io/react/\n[knex]: http://knexjs.org/\n\n[labels-epic]: {{ site.url }}{% link _goals/226-Trossello_Snapshot-Labels_Epic.md %}\n[trossello]: https://github.com/GuildCrafts/Trossello\n[starting-commit]: https://github.com/GuildCrafts/Trossello/tree/7130f2911389e60f8e2a8f3efec6a03a135a1c0f\n[example-pr]: https://github.com/GuildCrafts/Trossello/pull/130"
}