{
  "authors": [
    "tannerwelsh"
  ],
  "goal_id": 232,
  "team_size": 2,
  "title": "Trossello Snapshot: Members & Teams Epic",
  "created_at": "2017-03-22T11:10:48Z",
  "labels": [
    "snapshot"
  ],
  "published": true,
  "level": "2",
  "phase": 3,
  "redirect_from": "/goals/232",
  "base_xp": 250,
  "bonus_xp": 37,
  "url": "https://jsdev.learnersguild.org/goals/232-Trossello_Snapshot-Members_and_Teams_Epic.html",
  "dynamic": false,
  "content": "# Trossello Snapshot: Members & Teams Epic\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build CRUD apps from scratch with Node.js and PostgreSQL\n- Can use React to build stateful client-side applications\n- Have worked with SASS stylesheets\n- Have worked on a snapshot goal and/or with the Trossello codebase\n- Are familiar with SQL and SQL query writers like Knex.js\n- Are interested in working within a more complex, real-world codebase\n\n## Description\n\nStarting at commit [`d177114`][starting-commit], implement **board + card members** in the [Trossello][trossello] app.\n\nIf you are **new to snapshot goals or to the Trossello app**, you may want to try a slightly easier one first, like the [Labels Epic][labels-epic]. Read the [Context](#context) section to learn whether this project will be right for you.\n\nTo complete this goal, you'll be mimicking features of the real Trello app. To do this, you'll need to use good reverse-engineering skills:\n\n- Try out the feature for yourself\n- Note how it works in detail\n- Track what happens in response to different inputs\n\nIn the Trello app, boards can have \"members\". Board members are other Trello users who the board owner invites to collaborate on the board. They receive notifications about board activity and can be assigned to cards on the board.\n\nAssigning a member to a card \"subscribes\" them to that card, meaning that they will see activity for things like comments on the card, due date changes, and when the card moves.\n\nFinally, as part of the \"stretch\" specs in this goal, you may choose to implement the \"teams\" feature of Trello. In Trello, teams of members can be created, and teams can own boards.\n\nUse the real Trello app and the mockups below to guide your design and development process.\n\n### Setting Up Your Snapshot\n\n1. Fork & clone the [Trossello repo][trossello]\n1. Create and checkout a new branch for this goal, something like `members-and-teams`\n  ```\n  $ git checkout -b members-and-teams\n  ```\n1. Use `git reset --hard` to revert your local repo to the [starting commit][starting-commit]\n  ```\n  $ git reset --hard d177114b033eb950e6fdd4d620815b74b5f90eaa\n  ```\n1. Push your branch to the remote repo on GitHub\n  ```\n  $ git push -u origin members-and-teams\n  ```\n1. Get started on the specs!\n\n### Mockups\n\nMimic the real Trello interfaces for members and teams as closely as possible.\n\nHere are some example mockups that you can use as a reference. To be thorough, you will need to log in to Trello and explore the Members and Teams features yourself.\n\n#### Add Members to a Board\n\nThis animation (from the Trello site) shows the basic workflow of adding a member to a board:\n\n<img alt=\"members gif\" src=\"https://cloud.githubusercontent.com/assets/709100/24219290/988ba072-0f1c-11e7-9c49-f84c80e16636.gif\">\n\nNote how typing auto-updates the search results of Trello users.\n\nHere are some static mockups of the same workflow:\n\n##### Members list\n<img alt=\"board-add-members-list\" src=\"https://cloud.githubusercontent.com/assets/709100/24207107/70d91ba2-0ef6-11e7-8a19-0eb3bc431e8f.png\" width=\"800px\">\n\n##### Member search\n<img alt=\"board-add-members-list-with-entries\" src=\"https://cloud.githubusercontent.com/assets/709100/24207105/70d645ee-0ef6-11e7-83a3-dd47f61148dd.png\" width=\"800px\">\n\n##### List of members\n<img alt=\"board-members-list\" src=\"https://cloud.githubusercontent.com/assets/709100/24207108/70d9052c-0ef6-11e7-8f50-358d04abc4e3.png\" width=\"800px\">\n\n#### Add Members to a Card\n\nThere's no gif for adding members to a card :/ but here are some static mockups you can use. Also, make sure to try the feature out for yourself in Trello to see how it works.\n\n##### Member search in card\n<img alt=\"card-members-button-add\" src=\"https://cloud.githubusercontent.com/assets/709100/24207111/70ec01a4-0ef6-11e7-811a-c2d3126b8f9a.png\" width=\"800px\">\n\n##### Card shows members' avatars\n<img alt=\"card-members-show-modal\" src=\"https://cloud.githubusercontent.com/assets/709100/24207110/70e40d28-0ef6-11e7-9b17-762c2e81b373.png\" width=\"800px\">\n\n##### Board shows members' avatars on assigned cards\n<img alt=\"card-members-show-board\" src=\"https://cloud.githubusercontent.com/assets/709100/24207109/70e0bb1e-0ef6-11e7-8f06-597e99bcddee.png\" width=\"800px\">\n\n## Context\n\n[Trossello][] is a clone of the popular kanban software [Trello](https://trello.com/). It is built entirely by Learners Guild learners and staff.\n\nA **snapshot goal** is meant to simulate the experience of developing a feature for an existing project.\n\nYou will have to orient yourself to the codebase, its idioms and architecture, and whichever tools you'll need to implement the feature. This involves reading a lot of code. To succeed, you'll need to figure out how the code works first before you begin to add to it.\n\nAs a professional web developer, you will rarely be building a project from the ground up, touching only code that _you_ have written. More often than not, you'll be contributing to a large, shared codebase with lots of legacy code. Not everything will make sense. You can't just start writing code any way you want - you have to learn how to integrate with the existing code.\n\n_If you've never done a snapshot goal before_, this one may not be the best place to start as it is significantly challenge. You may want to try a slightly easier one first, like the [Trossello Snapshot - Labels Epic][labels-epic].\n\n## Specifications\n\n#### Members & Teams\n- [ ] Boards have members\n- [ ] Cards have members\n- [ ] Board owners can add members to their board using the board menu\n- [ ] Board owners can search for & add members by their name (not just email)\n- [ ] Board members receive messages in their activity feed when new cards are created\n- [ ] Board members receive messages in their activity feed when new members are added\n- [ ] Board members can add members to a card on the board using the card modal\n- [ ] Board owners can remove members from their board\n- [ ] Board members can remove members from a card on the board\n- [ ] Card members are identified by their avatar in the modal view\n- [ ] Card members are identified by their avatar in the board view\n- [ ] Card members receive messages in their activity feed for new comments on the card\n- [ ] Card members receive messages in their activity feed for changes to the due date\n- [ ] Card members receive messages in their activity feed for upcoming due dates\n- [ ] Card members receive messages in their activity feed for moving the card between lists\n- [ ] Tests exist for each of the above specs\n- [ ] UI looks the same as in the mockups\n\n#### General\n- [ ] All major features are added via pull requests with a clear description and concise commit messages.\n- [ ] Code uses a linter and there are no linting errors.\n- [ ] Variables, functions, files, etc. have appropriate and meaningful names.\n- [ ] The artifact produced is a fork of the [Trossello][trossello] repository\n\n### Stretch\n\nImplement the \"teams\" feature from Trello.\n\n- [ ] Users can create teams\n- [ ] Users can add members to their team\n- [ ] Team members can create team boards\n- [ ] Team members can remove team boards\n- [ ] Team boards automatically include all team members\n- [ ] Team boards work like regular boards in all other ways\n\n## Resources\n\n**Tools**\n\n- [React][react]\n- [knex.js][knex]\n\n**Help articles from Trello**\n\n- [Adding People To A Board](http://help.trello.com/article/717-adding-people-to-a-board)\n- [Adding A Member To A Card](http://help.trello.com/article/807-adding-a-member-to-a-card)\n- [Inviting People To A Team](http://help.trello.com/article/715-inviting-people-to-an-organization)\n\n[react]: https://facebook.github.io/react/\n[knex]: http://knexjs.org/\n\n[labels-epic]: {{ site.url }}{% link _goals/226-Trossello_Snapshot-Labels_Epic.md %}\n[trossello]: https://github.com/GuildCrafts/Trossello\n[starting-commit]: https://github.com/GuildCrafts/Trossello/commit/d177114b033eb950e6fdd4d620815b74b5f90eaa\n[example-pr]: https://github.com/GuildCrafts/Trossello/pull/106/"
}