{
  "authors": [
    "tannerwelsh"
  ],
  "goal_id": 235,
  "team_size": 4,
  "title": "Trossello Snapshot: Filter Cards Epic",
  "created_at": "2017-03-23T13:40:48Z",
  "labels": [
    "snapshot"
  ],
  "published": true,
  "level": "3",
  "redirect_from": "/goals/235",
  "url": "http://jsdev.learnersguild.org/goals/235-Trossello_Snapshot-Filter_Cards_Epic.html",
  "content": "# Trossello Snapshot: Filter Cards Epic\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build CRUD apps from scratch with Node.js and PostgreSQL\n- Can use React to build stateful client-side applications\n- Have worked with SASS stylesheets\n- Have worked on a snapshot goal and/or with the Trossello codebase\n- Are familiar with SQL and SQL query writers like Knex.js\n- Are familiar with the notion of \"filtering\" a data set by some condition\n- Are interested in working within a more complex, real-world codebase\n\n## Description\n\nStarting at commit [`55301b0`][starting-commit], implement **card filtering** in the [Trossello][trossello] app.\n\nIf you are **new to snapshot goals or to the Trossello app**, you may want to try a slightly easier one first, like the [Labels Epic][labels-epic]. Read the [Context](#context) section to learn whether this project will be right for you.\n\nTo complete this goal, you'll be mimicking features of the real Trello app. To do this, you'll need to use good reverse-engineering skills:\n\n- Try out the feature for yourself\n- Note how it works in detail\n- Track what happens in response to different inputs\n\nIn the Trello app, users can \"filter\" the cards shown on a board by a number of parameters: labels, members, due date, and more. This is a good way for users to focus on the cards that matter to them in a busy/cluttered board.\n\nFiltering cards causes the board to _only_ show the cards that \"pass\" the filter. For example, filtering for cards with a label \"feature\" will _only_ show cards on the board that have the \"feature\" label on them.\n\nTo make it easy to remove the filter, Trello adds a little \"Filtering is on\" badge to the board that users can click to edit/remove the filters.\n\nUse the real Trello app and the mockups below to guide your design and development process.\n\n### Setting Up Your Snapshot\n\n1. Fork & clone the [Trossello repo][trossello]\n1. Create and checkout a new branch for this goal, something like `filter-cards`\n  ```\n  $ git checkout -b filter-cards\n  ```\n1. Use `git reset --hard` to revert your local repo to the [starting commit][starting-commit]\n  ```\n  $ git reset --hard 55301b0218af35527c6f4a15e78f93fcc9e0cdd7\n  ```\n1. Push your branch to the remote repo on GitHub\n  ```\n  $ git push -u origin filter-cards\n  ```\n1. Get started on the specs!\n\n### Mockups\n\nMimic the real Trello interfaces for members and teams as closely as possible.\n\nHere are some example mockups that you can use as a reference. To be thorough, you will need to log in to Trello and explore the Members and Teams features yourself.\n\n#### Filter Cards Menu Item\n\nFilter cards pane can be accessed from the board menu.\n\n<img alt=\"filter-cards-menu-item\" src=\"https://cloud.githubusercontent.com/assets/709100/24263241/fcb15ebe-0fd2-11e7-9e1a-2fea7f684f50.png\" width=\"800px\">\n\n#### Filter Cards Pane\n\nFilter cards pane shows labels, members, and other filter types. Can even search for filter types.\n\n<img alt=\"filter-cards-pane\" src=\"https://cloud.githubusercontent.com/assets/709100/24263242/fcb47ac2-0fd2-11e7-877f-cb00d5314e70.png\" width=\"800px\">\n\n#### Filter Cards Board View\n\nWhen viewing a \"filtered\" version of a board, it shows a \"Filtering is on\" badge.\n\n<img alt=\"filter-cards-board-view\" src=\"https://cloud.githubusercontent.com/assets/709100/24263243/fcb4f056-0fd2-11e7-857e-2e6fd9b32199.png\" width=\"800px\">\n\n## Context\n\n[Trossello][] is a clone of the popular kanban software [Trello](https://trello.com/). It is built entirely by Learners Guild learners and staff.\n\nA **snapshot goal** is meant to simulate the experience of developing a feature for an existing project.\n\nYou will have to orient yourself to the codebase, its idioms and architecture, and whichever tools you'll need to implement the feature. This involves reading a lot of code. To succeed, you'll need to figure out how the code works first before you begin to add to it.\n\nAs a professional web developer, you will rarely be building a project from the ground up, touching only code that _you_ have written. More often than not, you'll be contributing to a large, shared codebase with lots of legacy code. Not everything will make sense. You can't just start writing code any way you want - you have to learn how to integrate with the existing code.\n\n_If you've never done a snapshot goal before_, this one may not be the best place to start as it is significantly challenge. You may want to try a slightly easier one first, like the [Trossello Snapshot - Labels Epic][labels-epic].\n\n## Specifications\n\n- [ ] Users can access the filter cards pane from the board menu\n- [ ] Users can filter cards on a board by:\n  - [ ] One or more labels\n  - [ ] One or more members\n  - [ ] Due in the next day\n  - [ ] Due in the next week\n  - [ ] Due in the next month\n  - [ ] Overdue\n  - [ ] Has no due date\n- [ ] When viewing a \"filtered\" version of a board, board shows a \"Filtering is on\" badge\n- [ ] Users can turn off filtering by clicking the \"X\" in a \"Filtering is on\" badge\n- [ ] Users can turn off filtering by clicking \"Clear Filter\" in the filter cards pane\n- [ ] Users can set filter to \"Match any label and any member\"\n- [ ] Users can set filter to \"Match all labels and all members\"\n- [ ] Tests exist for each of the above specs\n- [ ] UI looks the same as in the mockups\n- [ ] The artifact produced is a fork of the [Trossello][trossello] repository\n\n### Stretch\n\nImplement the \"filter search\" feature from Trello.\n\n- [ ] Users can search filter options in the filter cards pane\n- [ ] Results of search in filter cards pane show all matching labels and members for query\n\n## Quality Rubric\n\n**Well formatted code**\n- Code uses a linter, which can be invoked with a command (e.g. `npm run lint`). [50 points]\n- Running the linter on all source code files generates no linting errors. [50 points]\n\n**Good project management**\n- Commit messages are concise and descriptive. [25 points]\n- All features are added via pull requests. [25 points]\n- Every pull request has a description summarizing the changes made. [25 points]\n- Every pull request has been reviewed by at least one other person. [25 points]\n\n## Resources\n\n**Tools**\n\n- [React][react]\n- [knex.js][knex]\n\n**Help articles from Trello**\n\n- [Filtering Cards on a Board](http://help.trello.com/article/787-filtering-cards-on-a-board)\n- [Filtering vs. Searching](http://help.trello.com/article/972-filtering-vs-searching)\n\n[react]: https://facebook.github.io/react/\n[knex]: http://knexjs.org/\n\n[labels-epic]: {{ site.url }}{% link _goals/226-Trossello_Snapshot-Labels_Epic.md %}\n[trossello]: https://github.com/GuildCrafts/Trossello\n[starting-commit]: https://github.com/GuildCrafts/Trossello/commit/55301b0218af35527c6f4a15e78f93fcc9e0cdd7"
}