{"authors":["tannerwelsh"],"goal_id":237,"team_size":4,"title":"Trossello Snapshot: Deploy the Profile Epic","created_at":"2017-03-23T13:40:48Z","labels":["snapshot"],"published":true,"level":"2","redirect_from":"/goals/237","url":"http://jsdev.learnersguild.org/goals/237-Trossello_Snapshot-Deploy_the_Profile_Epic.html","content":"# Trossello Snapshot: Deploy the Profile Epic\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build CRUD apps from scratch with Node.js and PostgreSQL\n- Can use React to build stateful client-side applications\n- Have worked with SASS stylesheets\n- Have worked on a snapshot goal and/or with the Trossello codebase\n- Are familiar with SQL and SQL query writers like Knex.js\n- Are interested in working within a more complex, real-world codebase\n- Are interested in deploying apps to a live (production) server\n- Are interested in setting up and configuring continuous integration (CI)\n\n## Description\n\nStarting at the [`user-profiles`][starting-branch] branch, implement the **user profile page** in the [Trossello][trossello] app, deploy it to [Heroku][], and set up continous integration with [CircleCI][].\n\nIf you are **new to snapshot goals or to the Trossello app**, you may want to try a slightly easier one first, like the [Labels Epic][labels-epic]. Read the [Context](#context) section to learn whether this project will be right for you.\n\nTo complete this goal, you'll be mimicking features of the real Trello app. To do this, you'll need to use good reverse-engineering skills:\n\n- Try out the feature for yourself\n- Note how it works in detail\n- Track what happens in response to different inputs\n\nYou'll be building the user profile feature, which allows users to see an activity feed of events relevant to them and a list of cards that they are assigned to (are members of). It also allows users to edit their name/username/bio.\n\nAfter you build the features, you'll practice setting up, configuring, and deploying an app to a _real_ server. Using Heroku, which is the easiest way to deploy a web app online (also it's free for small apps), you'll put the app out there on the web for all to see! Well, probably not that many people will see it. But you can tell your friends to check it out :).\n\nYou'll also be setting up continuous integration (CI), which is a fancy way of saying \"a server that runs your tests for you before you merge any code to master\". CI is a widely accepted practice in software development, and part of a good development cycle.\n\nUse the real Trello app and the mockups below to guide your design and development process.\n\n### Setting Up Your Snapshot\n\n1. Fork & clone the [Trossello repo][trossello]\n1. Checkout the `user-profiles` branch\n  ```\n  $ git checkout user-profiles\n  ```\n1. Make sure the latest commit (`HEAD`) has the SHA that starts with `9ead865`\n  ```\n  $ git log -1 HEAD\n  commit 9ead86561ae3335d9209bc9e0addff90960624d6\n  ...\n  ```\n1. _If `HEAD` is not that commit_, use `git reset --hard` to revert your local repo to that commit\n  ```\n  $ git reset --hard 9ead86561ae3335d9209bc9e0addff90960624d6\n  ```\n1. Push your branch to the remote repo on GitHub (you may have to use `--force` if you did the hard reset before)\n  ```\n  $ git push -u origin user-profiles\n  ```\n1. Get started on the specs!\n\n### Mockups\n\nMimic the real Trello interfaces for members and teams as closely as possible.\n\nHere are some example mockups that you can use as a reference. To be thorough, you will need to log in to Trello and explore the Members and Teams features yourself.\n\n#### User Menu\n\nClicking user avatar / name in menu bar opens the user menu.\n\n![user-menu](https://cloud.githubusercontent.com/assets/709100/24263314/2f5de3dc-0fd3-11e7-8062-04ce3dbf11d9.png)\n\n#### Profile Page Activity\n\nDefault view of user page is profile tab.\n\n![profile-page-activity](https://cloud.githubusercontent.com/assets/709100/24263310/2f513290-0fd3-11e7-8ea0-b2a75bbd4195.png)\n\n#### Profile Page Edit\n\nClicking \"Edit profile\" button opens edit form.\n\n![profile-page-edit](https://cloud.githubusercontent.com/assets/709100/24263313/2f5d03a4-0fd3-11e7-87ac-ad94d7a97a13.png)\n\n## Context\n\n[Trossello][] is a clone of the popular kanban software [Trello](https://trello.com/). It is built entirely by Learners Guild learners and staff.\n\nA **snapshot goal** is meant to simulate the experience of developing a feature for an existing project.\n\nYou will have to orient yourself to the codebase, its idioms and architecture, and whichever tools you'll need to implement the feature. This involves reading a lot of code. To succeed, you'll need to figure out how the code works first before you begin to add to it.\n\nAs a professional web developer, you will rarely be building a project from the ground up, touching only code that _you_ have written. More often than not, you'll be contributing to a large, shared codebase with lots of legacy code. Not everything will make sense. You can't just start writing code any way you want - you have to learn how to integrate with the existing code.\n\n_If you've never done a snapshot goal before_, this one may not be the best place to start as it is significantly challenge. You may want to try a slightly easier one first, like the [Trossello Snapshot - Labels Epic][labels-epic].\n\n## Specifications\n\n- [ ] Users can click the user avatar / name in menu bar to opens the user menu\n- [ ] User menu includes links to:\n  - [ ] Profile => opens user page with profile tab open\n  - [ ] Cards => opens user page with cards tab open\n  - [ ] Sign Out => signs user out\n- [ ] Default view of user page is profile tab\n- [ ] Clicking \"Edit profile\" button on user page opens edit form\n- [ ] Users can edit their:\n  - [ ] Full Name\n  - [ ] Username\n  - [ ] Initials\n  - [ ] Bio\n- [ ] Profile tab of user page shows activity stream for user\n- [ ] Activity stream for user displays items for the following events _when they are taken by the signed-in user_:\n  - [ ] User creates board\n  - [ ] User adds list to board\n  - [ ] User removes list from board\n  - [ ] User adds card to list\n  - [ ] User moves card between lists\n  - [ ] User archives card\n  - [ ] User deletes card\n  - [ ] User adds member to board\n  - [ ] User removes member from board\n  - [ ] User adds member to card\n  - [ ] User removes member from card\n- [ ] Cards tab displays all cards that user is a member of\n- [ ] Cards tab sorts cards by board by default\n- [ ] User can switch cards tab to sort by due date (soonest first)\n- [ ] Tests exist for each of the above specs\n- [ ] UI looks the same as in the mockups\n- [ ] The artifact produced is a fork of the [Trossello][trossello] repository\n- [ ] App is deployed to Heroku\n- [ ] Deployed app works the same as in developemnt (no broken features)\n- [ ] README includes link to the deployed app\n- [ ] App is configured to use CircleCI continuous integration\n- [ ] CirlceCI badge is added to the README\n- [ ] Latest build is passing on CircleCI\n\n### Stretch\n\nUpdate user activity feed to also include events that _are not_ directly triggered by a user.\n\n- [ ] Activity stream for user displays items for the following events:\n  - [ ] User is added to a board\n  - [ ] User is removed from a board\n  - [ ] User is added to a card\n  - [ ] User is removed from a card\n  - [ ] New list is created on board that user is a member of\n  - [ ] New card is created on board that user is a member of\n  - [ ] Card that user is a member of is moved between lists\n  - [ ] New member is added to card that user is a member of\n\n## Quality Rubric\n\n**Well formatted code**\n- Code uses a linter, which can be invoked with a command (e.g. `npm run lint`). [50 points]\n- Running the linter on all source code files generates no linting errors. [50 points]\n\n**Good project management**\n- Commit messages are concise and descriptive. [25 points]\n- All features are added via pull requests. [25 points]\n- Every pull request has a description summarizing the changes made. [25 points]\n- Every pull request has been reviewed by at least one other person. [25 points]\n\n## Resources\n\n**Tools**\n\n- [React][react]\n- [knex.js][knex]\n- [Heroku][heroku]\n- [CircleCI][circleci]\n\n**Deployment & CI help**\n\n- [Deploying Node.js Apps on Heroku](https://devcenter.heroku.com/articles/deploying-nodejs)\n- [CircleCI docs on CI/CD with Node.js](https://circleci.com/docs/1.0/language-nodejs/)\n\n[react]: https://facebook.github.io/react/\n[knex]: http://knexjs.org/\n[heroku]: https://www.heroku.com/\n[circleci]: https://circleci.com/\n\n[labels-epic]: {{ site.url }}{% link _goals/226-Trossello_Snapshot-Labels_Epic.md %}\n[trossello]: https://github.com/GuildCrafts/Trossello\n[starting-branch]: https://github.com/GuildCrafts/Trossello/tree/user-profiles"}