{
  "authors": [
    "tannerwelsh"
  ],
  "team_size": 2,
  "goal_id": 251,
  "title": "Init 1: Bossggle Word Game",
  "created_at": "2017-03-30T10:38:28Z",
  "labels": [
    "practice",
    "foundational"
  ],
  "published": true,
  "level": "1",
  "redirect_from": "/goals/251",
  "url": "http://jsdev.learnersguild.org/goals/251-Init_1-Bossggle_Word_Game.html",
  "base_xp": 100,
  "bonus_xp": 15.0,
  "dynamic": false,
  "content": "# Init 1: Bossggle Word Game\n\n## Introduction\n\nWelcome to the first in the series of the initiation goals!\n\nThis is a big goal, with lots of extra material to help you get oriented. You don't have to know everything to get started, though.\n\nIf you're ready to jump in and start coding, start off with the [Description](#description) and get going on [Day 1](#day-1).\n\nIf you want to know more about what this goal is and how to use it, read the [Context](#context) section and/or review the answers to some [common questions](#questions).\n\nRemember to **take your time.** No need to rush. If you or are feeling overwhelmed or confused: take a breath, get up and stretch, ask someone for help, and/or take a break from the project and work something from the [Resources](#resources) section.\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Are in your first week at Learners Guild!\n- Have completed the [Runway][], but could use a refresher of core concepts\n- Can use an code editor like [Atom][]\n- Can clone and push to a GitHub repository\n- Can build basic web pages with HTML and CSS\n- Know the basics of JavaScript (variables, functions, conditionals, etc.)\n- Are interested in building a real \"interactive\" web page\n- Are interested in deepening your JS, HTML, and CSS skills\n- Are interested in getting oriented to how learning happens at Learners Guild\n\n## Description\n\n[Boggle][] is a word game where players use letters in a 4x4 grid to build words. In this goal, you'll work on a project to make an open-source software (OSS) version of Boggle called... **Bossggle**.\n\nIf you haven't played Boggle before, find a version of the game online (there are lots of free ones out there) and get acquainted with the rules.\n\nFor the sake of simplicity, the basic version of Bossggle will have a more lienient set of rules than traditional Boggle:\n\n- Consecutive letters don't have to be next to each other. You can choose any letter from the board.\n- Words can be of any length.\n- Words don't have to be English, or even a real word.\n\nTo build your version of Bossggle, use the [Mockups](#mockups) to guide your user interface (UI) development and complete as many of the [specs](#specifications) that you can.\n\nIf you get through the specs and still have time, try to complete some of the [Stretch](#stretch) specs.\n\n### Recommended Pace\n\nIt is recommended (but not required) that you follow along with the day-by-day pace included here. These are designed to help you break down the problem into more manageable parts so that you can pace your work appropriately and leave time to explore the [learning resources](#resources).\n\n#### Day 1\n\nWith your pair, work on the specs in [Stage 1](#stage-1) to build out the user interface (UI) so that it looks like the [new game mockup](#new-game).\n\nLeave some hours in the afternoon for _solo study_ time: use the [resources](#resources) and do your own research to fill any gaps in your skills. Since today focuses on **HTML** and **CSS**, here are some recommended resources (pick one, or skim both):\n\n- Shay Howe tutorial on Positioning Content (~1.5 hours reading + exercises; link in [Resources > Tutorials](#tutorials))\n- Treehouse course on CSS Layout Basics (~3 hours videos + exercises; link in [Resources > Courses](#courses))\n\nAfter solo study, sync back up with your pair to share what you learned. Together, make any revisions to your project code based on what you learned.\n\n#### Day 2\n\nWith your pair, work on the specs in [Stage 2](#stage-2) to add some basic interactivity to your game with JavaScript.\n\nThe specs for today focus mostly on **DOM manipulation** with JavaScript. Go as far as you can with your pair on the specs. When you get stumped, take a break for solo study. Recommended resources:\n\n- MDN guide on Introduction to the DOM (~20 minute guide + examples; link in [Resources > Guides](#guides))\n- Treehouse course on JavaScript and the DOM (~4 hours videos + exercises; link in [Resources > Courses](#courses))\n- Guide to the Basics of DOM Manipulation (~15 minute guide + examples; link in [Resources > Guides](#guides))\n\nMake sure to sync up after studying and _integrate_ your learning with your pair by sharing what you found out and applying it to your project code.\n\n#### Day 3\n\nWith your pair, work on the specs in [Stage 3](#stage-3) to continue adding interactive functionality to your game with event handlers.\n\nThe specs for the day cover more DOM manipulation and **browser events**. If you and your pair get stuck, take a break for solo study. Recommended resources:\n\n- Treehouse course on JavaScript and the DOM (~4 hours videos + exercises; link in [Resources > Courses](#courses))\n- MDN's Guide to Event Handlers (~15 minute guide + examples; link in [Resources > Guides](#guides))\n\nIf you break for solo study, make sure to sync up after and apply to your project code.\n\n#### Day 4\n\nWith your pair, work on the specs in [Stage 4](#stage-4) to implement the _scoring_ feature of the game.\n\nThis feature requires a bit more up-front design and **algorithmic thinking** to accomplish it. Make sure that you and your pair are clear on _how_ you want to solve the specs before you start coding them.\n\nDepending on your skill level, you may be able to finish these specs in time to move on to [Stage 5](#stage-5) or even the [Stretch](#stretch) specs. If so, great!\n\nIf you or your pair are struggling to complete the specs, consider spending time reviewing core **JavaScript programming** skills using the following recommended resources:\n\n- JavaScript.info tutorials, especially the JavaScript Fundamentals and Data Types sections (links in [Resources > Tutorials](#tutorials))\n- Treehouse workshop on Debugging JavaScript in the Browser (~40 minutes videos + exercises; link in [Resources > Courses](#courses))\n\n#### Day 5\n\nWith your pair, work on the specs in [Stage 5](#stage-5) to publish your game as a GitHub Pages site.\n\nThis is a shorter day because much of the day is dedicated to **reflection** and review. Get as much done as you can with your pair. If you have extra time, consider doing the [Stretch](#stretch) specs or building core skills with these recommended resources:\n\n- Treehouse workshop on GitHub Basics (~2 hours videos + exercises; link in [Resources > Courses](#courses))\n- Frontend Masters course on Introduction to JavaScript Programming (~3 hours videos; link in [Resources > Courses](#courses))\n\n## Context\n\nThe series of initiation goals are designed for new members of Learners Guild to get oriented to the learning environment, build key foundational skills, and work on some fun projects.\n\n1. [Init 1: Bossggle Word Game][bossggle-word-game]\n1. [Init 2: OOP Practice with Bike Shop][bike-shop-oop]\n1. [Init 3: Hello Web Servers][hello-web-servers]\n1. [Init 4: Relational Databases][relational-databases]\n1. [Init 5: Web APIs][web-apis]\n1. [Init 6: Developer Tools][developer-tools]\n\nBy the time you are finished with these initiation goals, you should be skilled enough to complete the [Simple Book Store][simple-book-store] goal: it is a good target for you to aim for in your first 6 weeks.\n\nThis first goal is meant to pick up roughly where you left off at the Enrollment Day: with the [\"Make a Word\" challenge](https://gist.github.com/lg-bot/f306837bb0fd958ef5de). The project you'll build is a more complex, in-depth version of the same idea.\n\nBy the time you're done with this goal, you will have:\n\n- Created a playable in-browser game from scratch\n- Published your code as a GitHub repository\n- Solidified your core front-end skills (HTML, CSS, and JavaScript)\n\n## Specifications\n\nThese are the basic specs for Bossggle, broken into 5 stages. If you complete these specs, try taking on some of the [Stretch specs](#stretch).\n\n#### Stage 1\n- [ ] Repo is created on GitHub.\n- [ ] The site looks the same as in the [mockups](#mockups) (except without the same words/letters/points - those are just placeholders).\n- [ ] Your repo includes the files: `index.html`, `main.css`, and `bossggle.js`.\n\n#### Stage 2\n- [ ] Clicking on a letter changes its color to orange.\n- [ ] Clicking on a letter adds it to the word.\n- [ ] The word is updated with each new letter.\n\n#### Stage 3\n- [ ] Pressing the \"Submit\" button submits the word for points.\n- [ ] Pressing the \"Clear\" button clears the word and all selected letters.\n- [ ] Pressing the \"Reset\" button clears the word, all selected letters, and generates a new set of letters on the board.\n\n#### Stage 4\n- [ ] Submitted words are added to the left in reverse chronological order (last word submitted is at the top).\n- [ ] Submitted words are awarded 9 points per letter.\n- [ ] Any word / combination of characters is allowed. There is no validation.\n- [ ] Players start with a score of 0.\n- [ ] The score is updated after each word is submitted.\n\n#### Stage 5\n- [ ] There is a link to the source code (your GitHub repo) in the bottom left.\n- [ ] Repo is published as a [GitHub pages][gh-pages] site.\n- [ ] The artifact produced is properly licensed, preferably with the [MIT license][mit-license].\n\n### Mockups\n\nTry to mimic the following mockups as closely as you can. Note that some of the features in the mockups are part of the [stretch specs](#stretch) - you don't have to build those yet.\n\n#### New Game\n\n<img alt=\"bossggle-mockup-blank\" width=\"800\" src=\"https://cloud.githubusercontent.com/assets/709100/24516044/5f309950-1547-11e7-9862-412d2cd2ed2f.png\" />\n\n#### Mid Game\n\n<img alt=\"bossggle-mockup-mid-game\" width=\"800\" src=\"https://cloud.githubusercontent.com/assets/709100/24516042/5f1e17c6-1547-11e7-8c93-e75612089c70.png\" />\n\n**with comments**\n\n<img alt=\"bossggle-mockup-mid-game-with-comments\" width=\"800\" src=\"https://cloud.githubusercontent.com/assets/709100/24624906/4273c616-187b-11e7-8846-1b5897230b3c.png\" />\n\n### Stretch\n\nIf you complete all of the specs listed above (the checkboxes), there's no reason to stop there! Try building more advanced features with these stretch specs.\n\n- [ ] Game uses real Boggle rules:\n  - [ ] Letters must all be connected (second letter must be a \"neighbor\" of the first letter, third letter must be a \"neighbor\" of the second, and so on).\n  - [ ] Words must be at least 3 letters long.\n  - [ ] Game is timed: players have 1 minute to make as many words as possible.\n- [ ] Words must be real English words; non-English words don't earn points. See [Validating Words](#validating-words) section for more information.\n\n#### Validating Words\n\nBuilding a game that can answer the question \"what is a valid word?\" is a harder problem than it might seem.\n\nFirst of all, who decides what \"valid\" means? Is it the Oxford English Dictionary? The Urban Dictionary? The list of words in your `/usr/share/dict/words` file?\n\nSecondly, no matter how you cut it, English has _a lot_ of words. That could present some architecture problems for us: how should we store and access a list of 200,000+ words?\n\nTo keep this problem more manageable, let's choose a subset of English words: just 1000 basic words from [this Wikipedia list][wiki-basic-words].\n\nIn fact, we even created a [small script][gist-basic-words] that you can use in your site to help with this validation. To use it, just add this `<script>` tag in your HTML `<head>`:\n\n```html\n<script src=\"https://cdn.rawgit.com/tannerwelsh/dcd33611c1bc615fd5a1c8cadc05d1b2/raw/470cde9d72927fef717f354b3ba3718a0aaabb99/basicWords.js\" charset=\"utf-8\"></script>\n```\n\nThen, you'll have access to a `isBasicWord()` function in your JavaScript that you can use to check if a word is included in that list of 1000. Here's how you use it:\n\n```javascript\nisBasicWord('candle') // => true\nisBasicWord('xenophon') // => false\n```\n\nThis isn't a _great_ final solution, but it's better than not validating at all :).\n\n## Resources\n\nUse these resources to fill in the gaps in your skills and knowledge as you find them. There is more here than you can do in a week, so focus on the areas that are in your zone of proximal development (ZPD).\n\n##### Guides\n\n- MDN: [Introduction to the DOM](https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model/Introduction) #html #dom #js\n- Blog post: [The Basics of JavaScript DOM Manipulation](http://callmenick.com/post/basics-javascript-dom-manipulation) #dom #js #html\n- MDN: [Guide to Event Handlers](https://developer.mozilla.org/en-US/docs/Web/Guide/Events/Event_handlers) #dom #js\n\n##### Courses\n\n- Treehouse: [Front-End Web Development Track](https://teamtreehouse.com/tracks/front-end-web-development) #js #html #css\n  - Lesson: [CSS Layout Basics][treehouse-css-layout-basics] #css #html\n- Treehouse: [JavaScript and the DOM (225m)](https://teamtreehouse.com/library/javascript-and-the-dom-2) #js #html\n- Treehouse: [JavaScript Basics (318m)](https://teamtreehouse.com/library/javascript-basics) #js\n- Treehouse: [Debugging JavaScript in the Browser (39m)](https://teamtreehouse.com/library/debugging-javascript-in-the-browser) #js\n- Frontend Masters: [Introduction to JavaScript Programming (3h)](https://frontendmasters.com/courses/javascript-basics/) #js\n- Lynda: [JavaScript Essential Training (5h 31m)](https://www.lynda.com/JavaScript-tutorials/JavaScript-Essential-Training/81266-2.html) #js\n- Treehouse: [GitHub Basics (2h)](https://teamtreehouse.com/library/github-basics) #github #git #projmgmt\n\n_Note: you can get a free Treehouse and Lynda account with an SF library card. Ask another learner to find out more._\n\n##### Tutorials\n\n- Shay Howe: [Learn to Code HTML & CSS](http://learn.shayhowe.com/html-css/) #html #css\n  - [Positioning Content](http://learn.shayhowe.com/html-css/positioning-content/) #css #html\n- [JavaScript.info](https://javascript.info/) #js\n  - [JavaScript Fundamentals](https://javascript.info/first-steps)\n  - [Data Types](https://javascript.info/data-types)\n\n##### Videos\n\n- Shereef's Core Vanilla JS videos: scroll to [\"Core Vanilla JavaScript\" section](https://shereef.wistia.com/projects/fwy60ilf20) #js\n\n## Questions\n\n#### How should I start working on this goal?\n\nOnce your project team is formed, you have to do a few things to get your project set up:\n\n1. Create a repo for this goal in your GitHub account. You can call it whatever you like, but `bossggle` is a good name. ([GitHub help][github-help-create-new-repo])\n1. Added an appropriate license to your repository, preferably the MIT license. ([GitHub help][github-help-license-a-repo])\n1. Add your pair to the repo as a collaborator. ([GitHub help][github-help-add-collaborator])\n1. Clone the repository to your local computer. ([GitHub help][github-help-add-collaborator])\n1. Open your repository in a code editor like [Atom][] and start writing your code!\n\nRead more about starting a project in the [Project Kickoff][playbook-proj-kickoff] section of the Playbook.\n\n#### What is a goal? How is it structured?\n\nGoals are programming **projects** designed to help you practice and build relevant, useful web development skills. Your objective is to create an **artifact** that meets all of the **specifications** outlined in the goal. This is very similar to how many real software teams work: developers receive \"specs\" from a product manager and/or designer, and they work in \"sprints\" to build software that meets the specs.\n\nGoals have 5 sections:\n\n- [Challenge Rating](#challenge-rating) - helps to determine if this goal is appropriately challenging given your current skill level.\n- [Description](#description) - tells you what the _output_ of this goal will be, without going into _too_ much detail.\n- [Context](#context) - useful background information to help you understand how to complete the goal and _why_ this goal is useful.\n- [Specifications](#specifications) - defines specific criteria that you must meet in order to complete the goal.\n- [Resources](#resources) (optional) - lists recommended resources such as articles, tutorials, or tools.\n\nNote that these Init series of goals are _more structured_ with a lot more _curated external resources_ than goals later in the program. This is meant to provide new learners with good [scaffolding][wiki-scaffolding] in their first weeks, but it does not reflect the _whole_ of the program. As you advance thorugh Learners Guild, goals become more open-ended, difficult, and chaotic. That is, after all, much more similar to how software development work actually happens. But we'll get to that later. :)\n\n#### How should I work with my pair?\n\nYou and your pair are responsible for two things:\n\n- Working together to complete the project\n- Helping each other to learn as much as you can\n\nAs you work through the initiation goals, you'll be learning how to balance and harmonize these two responsibilities. Sometimes that means that you are \"pair programming\" and actively solving a problem together; other times it means that you are spending time alone researching and studying so that you can come back to contribute better with your pair.\n\nIn the Playbook, there is a section on [Strategies for Team Learning][playbook-strategies-team]. Read this for more actionable ideas on how to best work in team.\n\n#### What if I have questions or need help?\n\nThis is a great question. When you are in your ZPD, you will have lots of questions and problems that you can't address alone.\n\nThe most efficient way to get help is to start with _highly available_ resources and then escalate to other people if you aren't able to find a way forward. In other words, if you have a problem and need help, go through the following steps to get \"unstuck\":\n\n1. Come up with a good question: be specific about what it is that you are struggling with\n2. Do online research: use Google, documentation, Q&A sites, etc.\n3. Get help from from your teammate/pair: two brains are better than one\n4. Request support from a coach: if they can't unstick you, they will escalate to someone who likely can\n\n#### What skills should I be building? How do I know I'm learning the right things?\n\nTo take a big-picture view of your learning progress, use the skills [Matrix][] to help chart your course through the wide array of skills needed to become a professional JavaScript web developer.\n\nWhen you are working on a goal, try to focus your work on the areas in your ZPD: challenge yourself by taking on the tasks/specs at your learning edge.\n\nIf you are not sure if you are learning the right things, talk to other learners or guild staff. They can help you determine what is relevant and what isn't.\n\n#### How do I \"complete\" this goal? How do I submit my project for review?\n\nWhen you are done with the goal (no matter how many specs you completed), you need to make it available for others to review.\n\nRead the [section on Reviews in the Playbook][playbook-reviews] for more information and instructions on how to do so.\n\n[wiki-basic-words]: https://simple.wikipedia.org/wiki/Wikipedia:List_of_1000_basic_words\n[gist-basic-words]: https://gist.github.com/tannerwelsh/dcd33611c1bc615fd5a1c8cadc05d1b2\n[raw-git-basic-words]: https://cdn.rawgit.com/tannerwelsh/dcd33611c1bc615fd5a1c8cadc05d1b2/raw/470cde9d72927fef717f354b3ba3718a0aaabb99/basicWords.js\n\n[simple-book-store]: {{ site.url }}{% link _goals/69-Simple_Book_Store.md %}\n\n[bossggle-word-game]: {{ site.url }}{% link _goals/251-Init_1-Bossggle_Word_Game.md %}\n[bike-shop-oop]: {{ site.url }}{% link _goals/252-Init_2-OOP_Practice_with_Bike_Shop.md %}\n[hello-web-servers]: {{ site.url }}{% link _goals/253-Init_3-Hello_Web_Servers.md %}\n[relational-databases]: {{ site.url }}{% link _goals/254-Init_4-Relational_Databases.md %}\n[web-apis]: {{ site.url }}{% link _goals/255-Init_5-Web_APIs.md %}\n[developer-tools]: {{ site.url }}{% link _goals/256-Init_6-Developer_Tools.md %}\n\n[runway]: https://playbook.learnersguild.org/Runway/\n[atom]: https://atom.io/\n[boggle]: https://en.wikipedia.org/wiki/Boggle\n[wiki-scaffolding]: https://en.wikipedia.org/wiki/Instructional_scaffolding\n\n[github-help-create-new-repo]: https://help.github.com/articles/creating-a-new-repository/\n[github-help-add-collaborator]: https://help.github.com/articles/inviting-collaborators-to-a-personal-repository/\n[github-help-clone-repo]: https://help.github.com/articles/cloning-a-repository/\n[github-help-license-a-repo]: https://help.github.com/articles/licensing-a-repository/\n\n[gh-pages]: https://pages.github.com/\n\n[playbook-proj-kickoff]: https://playbook.learnersguild.org/Learning_Guide/Kickoff.html\n[playbook-reviews]: https://playbook.learnersguild.org/Learning_Guide/Review.html\n[playbook-strategies-team]: https://playbook.learnersguild.org/Strategies/Team.html\n[matrix]: http://matrix.apps.learnersguild.org/\n\n[mit-license]: https://opensource.org/licenses/MIT"
}