{
  "authors": [
    "tannerwelsh"
  ],
  "team_size": 2,
  "goal_id": 291,
  "title": "Interview Prep",
  "created_at": "2017-04-12T12:00:00Z",
  "labels": [
    "practice"
  ],
  "level": "4",
  "published": true,
  "redirect_from": "/goals/291",
  "url": "https://jsdev.learnersguild.org/goals/291-Interview_Prep.html",
  "base_xp": 400,
  "bonus_xp": 60.0,
  "dynamic": false,
  "content": "# Interview Prep\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build full-stack web applications\n- Can contribute effectively on a team of web developers\n- Can write feature-complete, quality code\n- Can discuss and explain software using correct and precise technical terms\n- Have solved logic puzzles while verbalizing your thought process\n- Have used a whiteboard to diagram software systems\n- Are familiar with typical software engineering interview questions\n- Are interested in practicing being interviewed\n- Are interested in finding and filling the gaps in your \"job readiness\" skills\n\n## Description\n\nFind interviewing questions in your ZPD, research them, refine and practice your answer, and share with the community.\n\nYou'll choose 4+ challenging questions and spend the week developing solid answers to each of them. There are lots and lots of example interview questions on the web. Start by checking out the [Resources](#resources).\n\nThese questions could be specific and straight-forward, for example:\n\n> Write a function to determine if a given string is a palindrome (is the same word when written backwards)\n\nor they could be more high-level and broad, for example:\n\n> Design the application architecture for a web-based real time chat client (like Slack or HipChat)\n\nAfter you've chosen your questions, be sure to add them to the [Interview App][interview-app] so that others can benefit from them too :).\n\nFor at least 1 of these questions, you'll need to produce something shareable with the community so that other learners can benefit from what you've found out. This can take the form of a blog post, a live presentation with slides, or a screencast.\n\n### How to Get the Most from this Goal\n\nJust choosing questions and then finding the \"answer\" is not a very strong learning strategy. To truly build your skills so that you are prepared to give a competent, confident answer to these questions in a _real_ interview scenario, you should test yourself.\n\nFortunately, you have a teammate who can help you do this.\n\nTo test your knowledge of these questions, have your teammate give you a \"mock\" interview: they'll ask you the question and then give you feedback on how well you answered it. Repeat mock interviews for the questions you have the most trouble with until you can answer them competently and confidently.\n\n## Context\n\nThis goal assumes that you are at the stage of beginning to apply for jobs.\n\nBy this point, you should have a decent sense of what you are capable of, and which areas you are still working on (the [matrix](matrix.apps.learnersguild.org) is a good tool to help with this). If you are not clear about your own capacities, this goal may be too open-ended for you to get much value from it.\n\n## Specifications\n\n- [ ] Artifact produced is a gist.\n- [ ] 4+ questions per team member are chosen and added to the artifact.\n- [ ] In-depth answers to at least 1 question per team member have been shared with the community in the form of a blog post, presentation (with slideshow), or screencast.\n- [ ] All questions are submitted to the [Interview App][interview-app] (unless they are already in there).\n- [ ] Links to in-depth answers are added to the gist.\n\nFor each question, there exists...\n- [ ] A link to or citation of the question's source.\n- [ ] Links or notes with resources pertaining to the question.\n\n### Stretch\n\n- [ ] Questions and answers are added to the [Interview App][interview-app].\n\n## Resources\n\n- Book: [Cracking the Coding Interview](https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850/ref=pd_lpo_sbs_14_t_0?_encoding=UTF8&psc=1&refRID=ST9H0HC4AF2AS4K90FCV)\n- [Interview Cake](https://www.interviewcake.com/)\n\n[interview-app]: https://github.com/GuildCrafts/interview-app"
}