{
  "authors": [
    "Anasauce"
  ],
  "team_size": 2,
  "goal_id": 295,
  "title": "Work on Literator",
  "created_at": "2017-04-13T14:25:06Z",
  "labels": [
    "production"
  ],
  "published": false,
  "level": "4",
  "dynamic": true,
  "redirect_from": "/goals/295",
  "url": "http://jsdev.learnersguild.org/goals/295-Work_on_Literator.html",
  "base_xp": 400,
  "content": "# Work on Literator\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you…\n\n- Can use React & Webpack to build web apps\n- Can track and manage work using GitHub project management tools\n- Can write feature-complete, fully tested, quality code\n- Can debug programs in both client- and server-side environments\n- Have used Flux, Redux, and Fluxxor to do state management\n- Have strong JavaScript skills and knowledge\n- Have experience working on a remote team\n- Have worked with teams to deploy web apps\n- Are familiar with Python\n- Are familiar with collaborating on a living codebase\n- Are interested in working for a real client\n\n## Description\n\n[Literator][] is developing a great product for public schools and teachers to utilize technology in the classroom to track and improve literacy rates.\n\nLiterator's core values are improving equity in education and providing a high-quality tool for educators created by a public school teacher with the teacher's needs in mind.\n\nLiterator's stack:\n\n- Backend API using Python & Django\n- Mobile apps for iOS using Objective C and Android using Java\n- Web services with React/Webpack/Fluxxor\n\nThis goal is a chance to work on Literator's web services with active support and mentorship from their CTO Jeff Tchang. You would be working remotely with in-person support one to two days a week from Jeff.\n\nFor more information, read the [project proposal][].\n\n## Context\n\nThis is not a drill. This the real tamale.\n\nIf you choose this goal, you'll be working for an external client (i.e. not someone within Learners Guild) on a live, in-production codebase.\n\nOnly choose this goal if you are ready and willing to commit to multiple weeks of work in a new codebase with less support available. Because the technology is not managed by Learners Guild, there is no guarantee that coaches will be able to support you. You will likely need to figure out a lot of things on your own.\n\nThis is a great goal for testing your skills in a \"live\" remote development environment. It will be fun. It will not be easy.\n\n## Specifications\n\nSpecs will be determined at project start time.\n\n## Resources\n\n- [Literator's site][literator]\n- [Project Proposal Literator - Learners Guild][project-proposal]\n\nOn remote work:\n\n- [10 Secrets to Becoming a Great Remote Developer](https://x-team.com/blog/10-secrets-to-becoming-a-great-remote-developer/)\n- [8 Tips to Become an Effective Remote Developer](https://www.codementor.io/learn-programming/8-tips-to-become-an-effective-remote-developer)\n\n[literator]: http://www.literatorapp.com/\n[project-proposal]: https://github.com/GuildCrafts/web-development-js/files/917811/DevelopmentProjectProposalLearnersGuild.pdf"
}