{
  "authors": [
    "jlopker"
  ],
  "team_size": 2,
  "goal_id": 330,
  "title": "Roam",
  "created_at": "2017-05-12T10:38:28Z",
  "labels": [
    "practice"
  ],
  "published": true,
  "level": "3",
  "phase": 3,
  "redirect_from": "/goals/330",
  "url": "http://jsdev.learnersguild.org/goals/330-Roam-Travel-App.html",
  "base_xp": 300,
  "bonus_xp": 45.0,
  "dynamic": false,
  "content": "# Roam\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can use the [Express.js](https://expressjs.com/) framework to build a web app\n- Have used git and GitHub to do basic tasks like forking, cloning, making commits, and pushing to a remote repository\n- Are comfortable with the Node.js programming environment and with npm\n- Are familiar with HTML/CSS frameworks like Bootstrap\n- Are interested in building apps from wireframes\n- Are interested in user interface (UI) design\n\n## Description\n\nYou have been commissioned to build a travel community, code-named Roam for now, for users to share tips about their favorite locations around the world.\n\nThe client has provided basic wireframes and user stories (broken into sprints). In some cases, these requirements may be vague or incomplete.\n\n## Context\n\nThis goal will give you experience building an app from a set of client needs. **The goal is to gain experience working on a development project in a group while navigating a client's feature list.**\n\nChoose this goal if you’ve already build full-stack JavaScript apps are are interested in leveling-up your skills. Roam requires that you implement authentication- not a trivial task! This will be an immersive, intensive, and highly structured study.\n\n### Recommended Pace\n\nThe client contract consists of three core sprints and four bonus sprints. Each sprint contains a set of user stories.\n\nYou will work in a group of 2, and we expect you to **pair program** for the majority of the time you're writing code.\n\nDuring morning standups and in smaller check-ins throughout the day, clearly communicate your current status and next steps to your teammates. Consider using a kanban-style scrum board such as **GitHub Projects** or **Trello** to organize tasks.\n\nCommit changes at least once for each user story. Consider creating **automated tests** or even implementing TDD for any complex application behavior.\n\nPut effort into your **design**. Use a CSS framework (e.g. Bootstrap) and some custom CSS or Sass/Less.\n\nWork as **git collaborators, build on feature branches, and submit pull requests for approval and merging**.\n\nAfter each sprint, **deploy to heroku** to get practice getting the app online. The earlier you resolve deployment, the easier it will be on each updated version.\n\n**Refactor** your code after each sprint, considering:\n\n* Indentation\n* Readability/clarity\n* Naming\n* Organization\n* Commenting\n* DRYness\n\n#### Wireframes\n![wireframes](https://cloud.githubusercontent.com/assets/3010270/25254113/c2660cca-25d8-11e7-9a1b-22c254e9b75f.png)\n\n\n## Specifications\n\n#### Sprint 1: Basic Auth & Profiles\n\n**A user should be able to:**\n\n- [ ] Navigate to \"/\" and see a basic splash page.\n- [ ] See the name of the website on the splash page.\n- [ ] See links to \"Log In\" and \"Sign Up\" on the splash page.\n- [ ] Sign up for an account.\n- [ ] Log in to their account if they already have one.\n- [ ] Be redirected to their public profile page after logging in.\n- [ ] On their public profile page, see their name, the current city they have set in their profile, and their join date.\n- [ ] See the site-wide header on every page.\n- [ ] See a link to \"Log Out\" if they're logged in in the site-wide header.\n- [ ] See links to \"Log In\" and \"Sign Up\" if they're logged out in the site-wide header.\n- [ ] Update their profile by making changes to their name and/or current city.\n- [ ] See the titles of all the posts they've contributed (start with pre-seeded data).\n- [ ] Click on the title of one of their posts and be redirected to a \"show\" page for that post.\n- [ ] View post \"show\" pages with title, author, and content.\n\n##### Stretch\n\n**A user should be able to:**\n\n- [ ] See a \"default\" profile photo on their profile page before adding their own photo.\n- [ ] Update their profile photo (consider using Uploadcare).\n- [ ] See their profile photo next to their posts.\n- [ ] Receive a welcome email after creating an account.\n\n#### Sprint 2: Travel Tip CRUD\n\n**A user should be able to:**\n\n- [ ] Put at least 2 cities data in your database (make sure to include Oakland!)\n- [ ] View the \"Oakland\" city page (at \"/cities/1\").\n- [ ] See the site-wide header on the city page.\n- [ ] See the name of the city on the city page.\n- [ ] See an iconic photo of the city on the city page.\n- [ ] View a list of posts on the Oakland page.\n- [ ] See posts on city page sorted by newest first.\n- [ ] Click on post titles to go to the individual post \"show\" pages.\n- [ ] Use an \"Add New Post\" button on the Oakland city page to pull up the new post form.\n- [ ] Create a new post for Oakland\n- [ ] Click \"Edit\" on ANY individual post, and be redirected to the edit form.\n- [ ] Click \"delete\" on ANY individual post.\n- [ ] See a pop-up that says: \"Are you sure you want to delete {{title}}?\" when clicking \"delete\"\n- [ ] Have the post deleted when confirming the pop-up.\n\n##### Stretch\n\n**A user should be able to:**\n\n- [ ] Visit city pages via pretty urls, like \"/cities/san-francisco\".\n- [ ] Visit user profile pages via pretty urls, like \"/users/james\".\n- [ ] See post content truncated to 1000 characters max, with a link to view more on a city's page.\n- [ ] See a relative published date, e.g. \"2 days ago\" on a city's page.\n\n#### Sprint 3: Validations & Authorization\n\n**A user should be able to:**\n\n- [ ] View city pages for \"London\" and \"Gibraltar\".\n- [ ] Verify that a new post they create is successfully published on the correct city page.\n\nA user CANNOT save invalid data to the database, according to the following rules:\n\n- [ ] A user CANNOT sign up with an email (or username) that is already in use.\n- [ ] A post's title must be between 1 and 200 characters.\n- [ ] A post's content must not be empty.\n\nA user is authorized to perform certain actions on the site, according to the following rules:\n\n- [ ] A user MUST be logged in to create/update/destroy resources.\n- [ ] A user may only edit their own profile and edit/delete their own posts.\n\n###### Stretch\n\n**A user should be able to:**\n\n- [ ] View an error message when form validations fail, for the following validations:\n  - Title must be between 1 and 200 characters.\n  - Content must not be empty.\n- [ ] View only the 10 most recent posts on a city page (pagination).\n- [ ] View a link/button to the \"Next\" 10 on the city page (pagination).\n- [ ] View a link/button to the \"Previous\" 10 on the city page (pagination).\n- [ ] See a list of the city pages they've contributed to, on their public profile\n- [ ] See the number of posts they've written for each city, next to the city's name in their profile.\n- [ ] View all vagabond cities as markers/pins on a map on the site's homepage.\n- [ ] Click on a pin on the homepage map and be redirected to the corresponding city page.\n\n#### Sprint 4: Commenting\n\n##### Stretch\n\n**A user should be able to:**\n\n- [ ] Comment on individual posts.\n- [ ] See the number of comments a post has on the post's \"show\" page.\n- [ ] See the number of comments they've left, on their public profile.\n- [ ] Only add a comment when logged in.\n- [ ] Only edit/delete their own comments.\n\n## Resources\n\nUse these resources to fill in the gaps in your skills and knowledge as you find them. There is more here than you can do in a week, so focus on the areas that are in your zone of proximal development (ZPD).\n\n##### Passport Example apps\n- [Passport Express Example](https://github.com/passport/express-4.x-local-example): Note that there is no real DB here, data lives only on the server\n- [Passport Express, Twitter login](https://github.com/passport/express-4.x-twitter-example)\n\n##### Tools\n\n- [Express.js][express]: \"Fast, unopinionated, minimalist web framework for Node.js\"\n- [Passport](http://passportjs.org/): \"Simple, unobtrusive authentication for Node.js\"\n\n##### Guides\n\n- The official [Express.js Guide][express-guide] #express #nodejs\n- MDN: [Introduction to the DOM](https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model/Introduction) #html #dom #js\n- MDN: [Guide to Event Handlers](https://developer.mozilla.org/en-US/docs/Web/Guide/Events/Event_handlers) #dom #js\n\n##### Courses\n\n- Treehouse: [Express Basics (3h)](https://teamtreehouse.com/library/express-basics) #express #nodejs\n- Treehouse: [Understanding Express Middleware (23m)](https://teamtreehouse.com/library/understanding-express-middleware-2) #express #middleware\n- Code School: [Building Blocks of Express.js (5h)](https://www.codeschool.com/courses/building-blocks-of-express-js) #express #js\n\n##### Books\n\n- [Eloquent JavaScript](http://eloquentjavascript.net) #js\n  - Especially [Chapter 20: Node.js](http://eloquentjavascript.net/20_node.html) #nodejs"
}