{
  "authors": [
    "Jusdev89"
  ],
  "team_size": 2,
  "goal_id": 37,
  "title": "Common JS Utility Functions [Lodash]",
  "created_at": "2016-07-15T23:34:34Z",
  "labels": [
    "practice"
  ],
  "published": true,
  "level": "1",
  "redirect_from": "/goals/37",
  "url": "http://jsdev.learnersguild.org/goals/37-Common_JS_Utility_Functions-Lodash.html",
  "base_xp": 100,
  "bonus_xp": 15.0,
  "dynamic": false,
  "content": "# Common JS Utility Functions - Lodash\n\n## Challenge Rubric\n\nThis goal will likely be within your ZPD if you...\n\n- Can write JavaScript programs for Node.js\n- Can use problem decomposition to split difficult problems into smaller parts\n- Have used pseudocode as an intermediary step in writing a program\n- Are familiar with common JavaScript packages/libraries like Lodash or Underscore\n- Are interested in testing and test-driven-development (TDD)\n- Are interested in understanding how many of the most common utility functions actually work\n- Are interested in understanding how developers write high-level code for others to use\n- Are interested in reading and interpreting technical documentation\n- Are interested in writing ES2015\n\n## Description\n\nCreate a library of commonly used JavaScript utility functions by reverse engineering the popular [Lodash][lodash] library.\n\nUse the documentation to build a smaller clone of the [Lodash API][lodash-docs] (current version: 4.17.4) with ES2015. Publish the code as a package to NPM (stretch).\n\nIn addition to implementing the functions themselves, write tests for each of the functions. Luckily for you, _most of the work of writing tests has already been done for you_. Use the descriptions and examples from the documentation to make your tests.\n\nFor example, a test for the [`_.chunk()`](https://lodash.com/docs/4.17.4#chunk) Array method could look like this (using the Node.js builtin `assert` library):\n\n```javascript\nconst assert = require('assert')\nconst _ = require('array.js')\n\nassert.deepEqual(\n  _.chunk(['a', 'b', 'c', 'd'], 2),\n  [['a', 'b'], ['c', 'd']],\n  \"Creates an array of elements split into groups the length of size.\"\n)\n\nassert.deepEqual(\n  _.chunk(['a', 'b', 'c', 'd'], 3),\n  [['a', 'b', 'c'], ['d']],\n  \"If array can't be split evenly, the final chunk will be the remaining elements.\"\n)\n```\n\nNote that the code and messages were shamelessly copied directly from the [Lodash docs][lodash-docs].\n\n## Context\n\nThis project will take you into the realm of real a JavaScript library used by thousands (maybe millions) of developers across the world. You'll have to think like an open-source software developer and learn the benefits and constraints of such a role.\n\nIn addition, your code may be used by other developers to make their jobs easier. Hopefully this project helps you better understand how to contribute to the open source community so that you can be an active member throughout your career.\n\nThe questions that this project will raise are:\n- What happens \"under the hood\" of the most common utility functions?\n- How do we write packages that are easy to understand and simple to use out of the box?\n- How to publish a package to NPM? (part of stretch goal)\n\nThis goal is the sister goal of [Common JS Utility Functions - Underscore](202-Common_JS_Utility_Functions-Underscore.md).\n\n## Specifications\n\n- [ ] Tests and correct implementations exist for **32** (not all) utility functions from the Lodash library.\n- [ ] Functions are organized into files with the same names as the function groups from Lodash (e.g. \"Array\", \"Collection\", \"Lang\").\n- [ ] All code is written with ES2015.\n- [ ] Includes a README listing each method written and which file it is in.\n- [ ] Code uses a linter and there are no linting errors.\n- [ ] Code is well tested and all tests are passing.\n- [ ] All dependencies are properly declared in `package.json`.\n- [ ] All major features are added via pull requests with a clear description and concise commit messages.\n- [ ] Every pull request has been reviewed by at least one other person.\n- [ ] The artifact produced is properly licensed, preferably with the [MIT license](https://opensource.org/licenses/MIT).\n\n### Stretch\n\n- [ ] An additional **16** utility functions have tests and correct implementations.\n- [ ] Package is published to [NPM][npm].\n- [ ] All source code has inline documentation using [JSDoc][jsdoc] format.\n- [ ] Documentation is published a simple [GitHub Pages][github-pages] site (hint: use a builder like the [documentation package][npm-documentation]).\n\n## Resources\n\n- [Lodash site][lodash]\n- [JS Doc][jsdoc]\n- [Documentation generator][npm-documentation]\n\n[lodash]: https://lodash.com/\n[lodash-docs]: https://lodash.com/docs/4.17.4\n[github-pages]: https://pages.github.com/\n[jsdoc]: http://usejsdoc.org/\n[npm]: https://www.npmjs.com/\n[npm-documentation]: https://www.npmjs.com/package/documentation"
}