{
  "authors": [
    "FrankieFabuloso"
  ],
  "team_size": 2,
  "goal_id": 378,
  "title": "Socket.io: Party Chat",
  "created_at": "2017-05-12T14:38:28Z",
  "labels": [
    "practice"
  ],
  "level": "2",
  "published": true,
  "redirect_from": "/goals/378",
  "url": "http://jsdev.learnersguild.org/goals/378-Socket-Party_Chat.html",
  "base_xp": 200,
  "bonus_xp": 30.0,
  "dynamic": false,
  "content": "# Socket.io: Party Chat\n\n## Challenge Rubric\n\nThis goal will likely be in your ZPD if you...\n\n* Have built a couple of Full Stack Express.js applications from scratch.\n* Have used jQuery for dynamic DOM manipulation.\n* Are interested in authentication and want a deep dive into Express's middleware.\n* Want to level up your front-end development skills.\n* Are familiar with 'separation of concerns'.\n* Are familiar with HTTP and asynchronous client-server communication.\n\n## Description\n\nMany of the Express apps that we have in the goal library depend a lot on the rerendering of the client's view with any kind of application navigation.\n\nIf you have used React.js, you have noticed how whenever you follow a route your view is updated without any kind of page rerendering.\n\nThe goal you will be using Socket.io to establish an open connection to your ProstgreSQL database in order to update the view of your page anytime a user receives/sends a message to their PartyChat room without any page rerendering.\n\nThe end product will be an application where you can subscribe to a chatroom with a specific topic and chat with other people in real time.\n\n## Context\n\nThere are  two main focuses of this project:\n1. To set up authentication middleware and how to deal with HTTP's statelessness when we want to how to persist user log-in during requests and responses ( via session and cookies. )\n2. Learn about dynamic DOM manipulation on the client side by setting up a Socket for communication on changes on the front-end that will be persisted to your PSQL database.\n\nThis project will challenge you in being mindful about the architecture of your project and push you to be very thoughtful about modularizing your application into small working parts that are able to be pieced together to make a cohesive non-conflicting complex application.\n\nIf you choose this goal, you will have to consider questions such as:\n* How will my file structure affect the complexity of my application as it becomes more intricate?\n* When should I set cookies for my session and when should I clear them?\n* How do I make a schema that supports multiple users, multiple chatrooms, and what is the relationship between those two?\n* How can I render a new message as soon as my database knows about the message?\n* How do I separate my API's functionality and where does my socket fit into its architecture?\n\n## Specifications\n\n### General Specs\n\n- [ ] App has a **landing page** (on route `/`) where a user can either **log in** of **sign up**.\n- [ ] App has a **home page** (on route `/home`) where the user can see a list of chatrooms they have subscribed to along with a feed of all the conversation for currently selected room.\n- [ ] Uses Socket.io to make a socket.\n- [ ] Uses ajax/fetch calls to communicate with API endpoints.\n- [ ] Backend view rendering ( via pug or HTML ) is separated from API and socket actions.\n- [ ] Uses Javascript and/or jQuery for dymanic DOM mode creation and manipulation.\n- [ ] Repo includes a README.md with [spec list](http://jsdev.learnersguild.org/) and it is checked off with completed specs.\n- [ ] All dependancies are properly declared in a `package.json`\n- [ ] Variables, functions, files, etc. have appropriate and meaningful names.\n- [ ] Functions are small and serve a single purpose.\n- [ ] The artifact produced is properly licensed, preferably with the MIT license.\n\n### User log-in/sign-up story\n\n![landing_page_buttons](https://cloud.githubusercontent.com/assets/12012163/26009871/8c51315e-36ff-11e7-9c54-a5bc05d37879.png)\n\n![landing_page_login_form](https://cloud.githubusercontent.com/assets/12012163/26009900/a07c820a-36ff-11e7-870b-e19cfdea0cee.png)\n\n![landing_page_sign_up_form](https://cloud.githubusercontent.com/assets/12012163/26009910/a9edc24a-36ff-11e7-94e1-27be45c182d5.png)\n\n\n- [ ] View has a `log-in` button.\n- [ ] View has a `sign-up` button.\n- [ ] When `log-in` button is clicked, both `log-in` and `sign-up` button are hidden and a `log-in form` takes their place on the screen.\n- [ ] Same as above for `sign` up, but instead of a `log-in form` we see a `sign-up form`.\n- [ ] On **either form** clicking a `cancel` button removes the form from view, and we again get a view with the two buttons.\n- [ ] On `log-in form`, clicking submit will check to see if the user exists and authenticate the entered password with the user's stored password.\n- [ ] On `sign-up form`, clicking submit adds them to the database and logs them in.\n- [ ] On log-in, after the user is authenticated, a session is set.\n- [ ] Closing the page and reopening it will redirect user to `/home`\n- [ ] Session persists until `logout` or after 30 minutes pass.\n\n### User chatroom story\n\n![home](https://cloud.githubusercontent.com/assets/12012163/26009917/b81676f0-36ff-11e7-95fb-a7a888e47792.png)\n\n- [ ] User can make a new chatroom by clicking a `+` button.\n- [ ] User can search on a search bar that auto-completes with all of the chatrooms in the database that match the entered string.\n- [ ] User can see a `chatroom list` of all of the chatrooms they have subscribed too.\n- [ ] `<div class='messages [other classes] >'` exists as a container to where messages for a current chatroom are displayed.\n- [ ] When a chatroom in `chatroom list` is clicked, the `<div class='messages [other classes] >` displays a list of all the current messages in that chatroom.\n- [ ] User can unsubscribe from a chatroom and it is deleted from their `chatroom list`.\n- [ ] `messages div` has a textarea where you can enter a message.\n- [ ] User can send a message by clicking a send button and/or pressing the enter keyboard key.\n- [ ] Messages are displayed in descending chronological order. ( oldest on top of history )\n- [ ] User's sent messages are displayed on the right side, all other messages on the left side.\n- [ ] Anytime a message is sent, anyone in the chatroom can see the new message almost immediately. ( You can do this by logging in as a different user on a new browser window )"
}