{
  "authors": [
    "tannerwelsh"
  ],
  "team_size": 1,
  "goal_id": 394,
  "title": "Work on Ripple",
  "created_at": "2017-05-16T14:25:06Z",
  "labels": [
    "production"
  ],
  "published": false,
  "level": "4",
  "dynamic": true,
  "redirect_from": "/goals/394",
  "url": "https://jsdev.learnersguild.org/goals/394-Work_on_Ripple.html",
  "base_xp": 200,
  "bonus_xp": 15.0,
  "content": "# Work on Ripple\n\n<strong style=\"color:red;\">THIS IS AN EXTERNAL, OPEN-SOURCE PROJECT. NO COACHING WILL BE AVAILBLE FOR THIS PROJECT. BEFORE YOU VOTE ON THIS GOAL, CHECK IN WITH @tannerwelsh.</strong>\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build full-stack web applications with Express and Postgres\n- Can write feature-complete, fully tested, quality code\n- Can debug programs in both client- and server-side environments\n- Have worked with teams to deploy web apps\n- Are familiar with the GitHub project management tools\n- Are interested in working with a new kind of database\n\n## Description\n\nRipple is an open-source rapid response tool allows an organization to ask their supporters to send an SMS message to a specific number in order to capture their info and engage them moving forward.\n\nRepo: [https://github.com/strive-digital/ripple](https://github.com/strive-digital/ripple)\n<br>Main project: [https://github.com/strive-digital/ripple/projects/1](https://github.com/strive-digital/ripple/projects/1)\n\n## Context\n\nThis is not a drill. This the real tamale.\n\nIf you choose this goal, you'll be working for an external client (i.e. not someone within Learners Guild) on a live, in-production codebase.\n\nOnly choose this goal if you are ready and willing to commit to multiple weeks of work in a new codebase with less support available. Because the technology is not managed by Learners Guild, there is no guarantee that coaches will be able to support you. You will likely need to figure out a lot of things on your own.\n\nThis is a great goal for testing your skills in a \"live\" remote development environment. It will be fun. It will not be easy.\n\n## Specifications\n\nRead the [README](https://github.com/strive-digital/ripple) to learn how to contribute.\n\n## Resources\n\nOn remote work:\n\n- [10 Secrets to Becoming a Great Remote Developer](https://x-team.com/blog/10-secrets-to-becoming-a-great-remote-developer/)\n- [8 Tips to Become an Effective Remote Developer](https://www.codementor.io/learn-programming/8-tips-to-become-an-effective-remote-developer)"
}