{
  "authors": [
    "phoniks",
    "DianaVashti",
    "tannerwelsh"
  ],
  "team_size": 2,
  "goal_id": 62,
  "title": "Browser Games: Blackjack",
  "created_at": "2017-04-29T11:00:00Z",
  "labels": [
    "practice"
  ],
  "published": true,
  "level": "1",
  "base_xp": 125,
  "redirect_from": "/goals/62",
  "url": "http://jsdev.learnersguild.org/goals/62-Browser_Games-Blackjack.html",
  "bonus_xp": 18.75,
  "dynamic": false,
  "content": "# Browser Games: Blackjack\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build basic web sites with HTML & CSS\n- Can add behavior to a web site with JavaScript\n- Can use jQuery\n- Are familiar with DOM manipulation\n- Are familiar with the game Blackjack\n- Are interested in making more complex interactive web pages\n\n## Description\n\nBuild a [Blackjack](https://en.wikipedia.org/wiki/Blackjack) game in the browser using HTML, CSS, JavaScript, and the [jQuery][jquery] library.\n\nFork the the [browser-games repository][browser-games] and use the fork as your project artifact.\n\nImplement the **Blackjack** game from the list in the [games.md][games-list] file.\n\nIf you are not familiar with Blackjack, read up on the rules before beginning this project. Here is a brief overview of how the game works:\n\n- Dealing:\n  - Two cards are dealt to player\n  - One card face up, one card face down are dealt to Dealer\n  - Before each round, deck is shuffled\n- Player Logic:\n  - If player gets Blackjack right at the start (Natural), player wins\n  - Repeat hit or stay until player chooses to stay:\n  - Player chooses to hit or stay\n  - If player goes over 21, player busts and dealer wins\n- Dealer Logic:\n  - Dealer always hits when total is 16 or under\n  - Dealer always stays when total is 17 or higher\n  - If dealer hits and busts, player wins\n- Game Logic:\n  - Compare player total to dealer total, highest wins\n  - If player wins, players get their bet back, doubled\n\nFor an example implemented games, check out http://math.hws.edu/eck/cs271/js-work/Blackjack.html. There is also a tutorial on Codecademy for building a blackjack game: https://www.codecademy.com/courses/blackjack-part-1/0/1.\n\n## Context\n\nThis goal will challenge your ability to take a _formal, defined system_ from the real world and replicate it in code. You will start with all of the logic of the system (the rules of the game) already designed.\n\nYour work will be mainly in deciding how to replicate that formal logic and user interface using JavaScript, HTML, and CSS.\n\n## Specifications\n\n#### General\n\n- [ ] Artifact produced is a fork of the [browser-games][browser-games] repo.\n- [ ] Variables, functions, files, etc. have appropriate and meaningful names.\n- [ ] HTML, CSS, and JS files are well formatted with proper spacing and indentation.\n- [ ] All major features are added via pull requests with a clear description and concise commit messages.\n- [ ] Every pull request has been reviewed by at least one other person.\n- [ ] The artifact produced is properly licensed, preferably with the [MIT license][mit-license].\n\n#### Blackjack\n\n- [ ] Blackjack game can be found at `public/blackjack.html`\n- [ ] Blackjack game is playable by one person against a computer dealer\n- [ ] Blackjack game page is linked from `public/index.html`\n- [ ] The player has a bank, and can continue playing rounds until they quit or are out of bankroll.\n- [ ] The game tracks the bets, outcomes, and bank.\n- [ ] The dealer/house has unlimited funds.\n- [ ] The player can only see one of the dealers two cards during their turn.\n- [ ] The dealer takes their actions after the user.\n- [ ] The dealer gets to go second and will always try and win. (If you don't bust the dealer will hit until they win or bust.)\n- [ ] An Ace is worth 11 unless it would put the player over 21, in which it becomes worth 1. This is still true for multiple Ace's (Example: A♠︎, A♣️, 9♦️ => 1, 11, 9 => 21)\n- [ ] The game does not allow you to bet more than you have.\n- [ ] Each round begins by showing you your current bankroll, and you can bet as much or as little of that total as you wish.\n- [ ] The house pays out on a 1:1 profit on wins (example: If you have $10, bet it all, and win, you now have $20)\n\n### Stretch\n\n- [ ] The game supports multiple user-players.\n- [ ] The dealer AI considers all players in multi-player format when executing their logic.\n- [ ] There is a multiplayer format without a dealer ( player vs. player: Game ends when one player is out of bankroll )\n- [ ] The payout on a natural blackjack is 3:2 instead of 1:1\n\n## Resources\n\n- Shay Howe: [Learn to Code HTML & CSS](http://learn.shayhowe.com/html-css/) #html #css\n- [jQuery Learning Center](https://learn.jquery.com/) #jquery\n- Code School: [Try jQuery](https://www.codeschool.com/courses/try-jquery) #jquery #js #dom\n- CSS Tricks: [Learn jQuery from Scratch](https://css-tricks.com/lodge/learn-jquery/) #jquery #js #dom\n\n\n[browser-games]: https://github.com/GuildCrafts/browser-games\n[games-list]: https://github.com/GuildCrafts/browser-games/blob/master/games.md\n[mit-license]: https://opensource.org/licenses/MIT"
}