{"section":"Team Development","groups":[{"group":"Agile and Lean","levels":[{"level":0,"description":"Daily standup, track progress in ticket tracker"},{"level":1,"description":"Code is deployed regularly through CI, at least 50% test coverage, basic user tracking and experiments"},{"level":2,"description":"Code is deployed multiple times a day, run through ~100% code coverage including functional/nonfunctional tests, features are validated with split testing before deemed finished"},{"level":3,"description":"Validates functionality quickly using marketing and prototypes before anything is built, multivariate testing (dozens) with statistical analysis, knows when to pivot/persevere and has experienced multiple pivots"}]},{"group":"Community Participation","levels":[{"level":0,"description":"Collects cool things on Twitter, files issues in repos, reads tech/programming blogs and podcasts regularly"},{"level":1,"description":"Writes posts on Medium, *fixes* issues on github, maintains a programming journal with some colleciton of useful articles/tools. Attended conferences. "},{"level":2,"description":"Actively maintains a popular OSS repo, benefits other programmers with their knowledge, has spoken at a conference. Maintains a blog in which personal insights and thoughts on programming are shared."},{"level":3,"description":"Has reinvented software development in some way, created a major, popular framework"}]},{"group":"Pairing","levels":[{"level":0,"description":""},{"level":1,"description":"Beginning pairing"},{"level":2,"description":"Intermediate pairing"},{"level":3,"description":"Advanced pairing"}]},{"group":"Source Control","levels":[{"level":0,"description":"GUI, command line basics (add, push, pull, fetch), reading from github, writing to github (PRs, forks)"},{"level":1,"description":"git command line (reset/revert), merge conflict resolution"},{"level":2,"description":"git command line (rebase, cherry-pick), has worked in an org with branching and PRs"},{"level":3,"description":"git command depth (bisect, interactive rebase, submodules, multiple remotes, git push -f), commit hooks, Integration with other services (CI, Slack)"}]},{"group":"Technical Communication","levels":[{"level":0,"description":""},{"level":1,"description":"Peers can understand what is being said. Good spelling and grammar."},{"level":2,"description":"Communication is effective, precise and more technical"},{"level":3,"description":"Able to understand and communicate thoughts, design, ideas, specs in a unambiguous manner and adjusts communication as per the context (written, spoken, white-boarding, brainstorming, specing...etc.)"}]}]}