{"authors":["@shereefb"],"issueNumber":181,"teamSize":2,"content":"\n# Timeoff Snapshot [Approver Epic]\n\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Have built simple CRUD apps with node.js\n- Interested in tackling a bigger challenge involving a more complex codebase\n- Have some familiarity with testing web apps\n\n## Description\n\nA Snapshot goal is based on a medium-to-large-sized repo that is \"frozen\" in time. It's meant to simulate the experience of developing a feature for an existing \"live\" open source project.\nUse snapshot goals to learn about working with larger code bases, and getting a simulated experience of being in a live sprint to push a set of features across the finish line.\n\nThis repo is a Timeoff Manager which is used by small to medium sized companies to manage requests for time off by it's employees.\n\n# Context\n\nHaving learned the basics of CRUD apps, you'll spend as much time reading code as writing it, and having to design creative solutions within a legacy codebase.\n\n## Specifications\n\n\n- [ ] Complete all eight user stories in the [Epic 1: New Role: Approvers][repo]\n\n- [ ] Practice an Agile approach to developing this epic:\n  - All user stories are added as issues to github (in your fork of timeoff.management) and tracked there\n  - Start a [project](https://help.github.com/articles/about-projects/) in github, add all user stories to it, and drag one issue at a time from the `backlog` to `in progress`\n  - Every user story should be in its own clean pull request, with unit and integration tests included. PRs should not span multiple user stories, and user stories should not span multiple PRs\n  - Practice a daily standup with your pair: \"what we worked on yesterday, what we are accomplishing today, what's blocking\"\n\n### Stretch\n\n- [ ] Complete all five user stories in the [Epic 2: New Role: Backend User][repo]\n\n## Quality Rubric\n\n- Code Construction: [40 points]\n  - Concise commenting\n  - Intermediate variables\n  - No long functions\n  - Well-factored self-documenting code\n  - Eslint is setup\n- Code Readability: [40 points]\n  - Good names for files, variables classes, methods etc.\n  - Consistent white space usage\n  - Comments explaining unusual code, bug fixes, code assumptions functions\n  - Clean, precise commit messages\n- Code Organization: [20 points]\n  - Methods are grouped logically or by accessibility. Basic separation of code into logical folders\n  - Code is grouped into regions and well commented with references to other source files. Each physical file has a unique purpose\n\n  [repo]:https://github.com/GuildCrafts/timeoff.management/blob/master/user_stories.md\n"}