{"authors":["@shereefb"],"teamSize":1,"issueNumber":83,"title":"Browser Games: Simon & Tic-Tac-Toe","createdAt":"2016-10-05T21:34:11Z","labels":["foundational"],"level":"1","published":true,"content":"\n# Browser Games [Basic]\n\n## Challenge Rating\n\nThis goal will likely be within your ZPD if you...\n\n- Can build basic web sites with HTML & CSS\n- Can add behavior to a web site with JavaScript\n- Are familiar with DOM manipulation\n- Are familiar with games like tic-tac-toe and Simon\n- Are interested in making more complex interactive web pages\n\n## Description\n\nBuild simple graphical games for the browser.\n\nFork the the [browser-games repository][browser-games] and use the fork as your project artifact.\n\nImplement the games **Tic-Tac-Toe** and **Simon** from the list in the [games.md][games-list] file.\n\nYou will be using FreeCodeCamp challenges as guides and tutorials for building these games.\n\n## Context\n\nThis goal will challenge your ability to take a _formal, defined system_ from the real world and replicate it in code. You will start with all of the logic of the system (the rules of the game) and most of the UI already designed.\n\nYour work will be mainly in deciding how to replicate that formal logic and user interface using JavaScript, HTML, and CSS.\n\n## Specifications\n\n- [ ] Artifact produced is a fork of the [browser-games][browser-games] repo.\n- [ ] For **both** of the games Tic-Tac-Toe and Simon, there exists:\n  - [ ] A playable, complete version of the game at `public/GAME_NAME.html` (e.g. `public/ticTacToe.html`)\n  - [ ] A link to the game page from `public/index.html`\n- [ ] The artifact produced is properly licensed, preferably with the [MIT license][mit-license].\n\n## Quality Rubric\n\n**Good code style**\n- HTML, CSS, and JS files are well formatted with proper spacing and indentation. [50 points]\n- Descriptive, well-named functions, variables, files, CSS classes, etc. [50 points]\n\n**Good project management**\n- Commit messages are concise and descriptive. [25 points]\n- All features are added via pull requests. [25 points]\n- Every pull request has a description summarizing the changes made. [25 points]\n- Every pull request has been reviewed by at least one other person. [25 points]\n\n[browser-games]: https://github.com/GuildCrafts/browser-games\n[games-list]: https://github.com/GuildCrafts/browser-games/blob/master/games.md\n[basic-games]: https://github.com/GuildCrafts/browser-games/blob/master/games.md#basic-graphical-games\n"}